[{"time":1685061834730,"text":"Going to start moving announcements and bug-updates to this clean channel, just to make sure they can be seen. Thank you for your patience as we try to make the server more useful. Your suggestions are always welcome."},{"time":1685066578531,"text":"**Homeworlds:** Fixed a bug that kept some sacrifice moves from completing properly. Also tweaked some of the help text to be more...helpful. Also added a CATASTROPHE button. You can still click on the background of a system to trigger a catastrophe, but that wasn't particularly intuitive. We remain committed to making things as intuitive as possible. Your feedback is warmly welcomed. The most consistent lesson of my professional life has been that what's obvious to one person is likely not obvious to another!"},{"time":1685066602185,"text":"The issue with the Homeworlds click handler in Firefox is still being worked on. We at least know what's causing it. Hopefully we can work around it. Firefox always does things differently!"},{"time":1685125093695,"text":"**Homeworlds**: The click handler has been fixed to work with Firefox. Thank you for your patience! Fixes for Volcano power moves are forthcoming."},{"time":1685130791874,"text":"Volcano: Power plays should now be clickable in Firefox. Hover should now correctly show the stack on the side even during partial moves (including power plays). The stash labels shouldn't be getting truncated anymore. I had to clear my JavaScript cache for the change to show."},{"time":1685382584578,"text":"**Testers wanted for new game Realm!** This is the first time we've added a game since going live, so let me explain how this works. If you want to help with the testing, please visit <https://play.dev.abstractplay.com> and create an account. (The user accounts, game records, ratings—everything—are completely separate from the production server.) Then start some games and intentionally try to break it! I will accept all challenges. Please report any issues. Once I'm comfortable the code is correct and stable, we'll move it over to the production server. Thanks in advance for the help!"},{"time":1685382603493,"text":"Tagging @Nienna  and @Mobynostromo , who are, I believe, our resident Realm experts."},{"time":1685833469075,"text":"**Testers wanted for new game Alien City!** The rules for this game can be a little confusing, and I would be shocked if I didn't make some mistake somewhere. But my basic testing is showing things as working as I expect, which again, may not be correct 🙂 I would be grateful if Alien City lovers could dive in and do some testing on the Dev server, as described above. Thanks for the help!"},{"time":1685833481975,"text":"Tagging @Nienna , who formally requested I transfer the game."},{"time":1685835830544,"text":"I notice it's running a little slow in the live environment. It needn't stop people from testing. It gets more responsive as the board fills up. I am working on efficiency."},{"time":1685906360929,"text":"This Homeworlds change is a tweak to the build command click handler. You can now click directly on the ship you wish to duplicate."},{"time":1686170187564,"text":"**Testers wanted for new game Fanorona!** Suggested by @eykca and existing on SDG 1.0, it is now available for testing. Interested parties should create an account on the dev server (https://play.dev.abstractplay.com) and try to break it. I'll accept all challenges. Thank you!"},{"time":1686247755375,"text":"**New game Realm now live!** Thank you to all our testers!"},{"time":1686255804181,"text":"**Testers wanted for new game Focus!** Interested parties should create an account on the dev server (https://play.dev.abstractplay.com) and try to break it. I'll accept all challenges. Thank you!! (Tagging @dx  and @tommynomad , who requested the game.)"},{"time":1686263596214,"text":"I'll note that I slightly altered the notation since SDG 1.0. When placing a piece from your hand, you prefix the cell with a plus sign (e.g., `+d4`)."},{"time":1686266966511,"text":"I just got a suggestion for Zendo (thank you, @benoke98). I love Zendo, but it simply won't work in the infrastructure we've built here. If I can come up with a way, I will. I promise. But let me take this opportunity (a) to point people to the excellent Zendo Discord channel (https://discord.gg/gdmwPMuTyb) and (b) to point people to the *synchronous*, live-play Zendo client that I wrote a little while back: GitHub (https://github.com/AbstractPlay/zendo), **playable version** (https://www.perlkonig.com/zendo/). Just thought I'd put that one to bed for now. But please continue to suggest games you love! I'm typing like a maniac over here, as the four new games being tested attest. Thanks for playing!"},{"time":1686348036753,"text":"Homeworlds has been fixed so you can trigger catastrophes at any point in your turn. I've done what testing I can, but Homeworlds is very complicated code. Let me know if something doesn't work as expected."},{"time":1686419820062,"text":"The Homeworlds click handler has been adjusted to make use of sacrifice actions simpler. If you have remaining actions of a particular colour, the move box will autofill with the appropriate keyword. Clicking the Pass button will correctly clear the partial entry. My testing shows things functioning as I expect, but again, this is complicated code. Let me know if something isn't working as you expect. (Tagging @mneme, who indirectly gave me the idea for this change.)"},{"time":1686419856835,"text":"We warmly welcome concrete suggestions on how to make the click handling and gameplay more intuitive for all the games, but especially the more complicated, multi-move ones like Homeworlds."},{"time":1686596808342,"text":"**Testers wanted for new game Pulling Strings!** This one is a simultaneous action selection game where you pull strings along the outside edge of the board to manoeuvre five or more coins onto your home spaces. This is one of those \"get into your opponent's head\" games that can be infuriating and fun at the same time. Please come join us on the dev server and help me make sure things are working as intended."},{"time":1686596881849,"text":"By way of reminder, the following games are in testing: Alien City, Fanorona, Focus, and now Pulling Strings. Thank you to our testers!"},{"time":1686694125430,"text":"**Testers wanted for new game Witch Stones!** The migration blitz continues. In this game, four types of pieces randomly fill a board, and players take turns removing stones and scoring points. First to 50 wins! Interested parties can join us on the dev server to try to break things. Thank you, testers!"},{"time":1686694341693,"text":"I have a soft goal of completing the SDG 1.0 migration and fully decommissioning it by the end of this year. I'm down to about a dozen games left that I think really should move over (I started with a list of 50), but I'll seriously consider *any* SDG 1.0 game that someone explicitly requests. So if you have a favourite that you want to make sure survives, please use the `/suggest` command to have it added to the list."},{"time":1686757949829,"text":"I pushed changes (hopefully fixes) to the Your Turn notification code, so I apologize for the double emails. I'm sure there's still something not quite right, so please continue to report issues and I'll see what I can track down. A reminder that you won't get emails from us unless your email address was verified when you created your account. If you're not getting emails at all, let me know in DM and I'll see what we can track down. Thanks for your patience."},{"time":1686841596609,"text":"New, more compact Homeworlds renderer is being pushed to production as we speak. I am certain more tweaks will be needed, but I think it's a solid enough improvement to roll out immediately. Nothing else has changed yet. Simplifying the click handler is the next step. I warmly welcome feedback on how to improve things further. Thank you! (Tagging @mneme , @hoembla , and @ManaT )"},{"time":1686875171300,"text":"**New Homeworlds click handler now active.** Thank you all Homeworlds players, and in particular @mneme , for your concrete suggestions about how to improve the Homeworlds experience. A new click handler is now available alongside the old one. The old one only gets triggered if you're entering moves in a combination of typing and clicking or if you're continuing a string of sacrifice moves. Most moves, however, are now reduced to 1 to 3 clicks, as follows:\n```txt\nenemy -> ATTACK\nfriendly > same friendly -> BUILD\nfriendly > stash -> TRADE\nfriendly > system -> MOVE\nfriendly > VOID (the space between systems) > stash -> DISCOVER\n```\n\nThe help text has been similarly updated. I've done a fair bit of testing, but there are always edge cases. Please let me know if you run into any trouble, and I remain open to further discussion on how to make things better. Thanks for playing with us!"},{"time":1687027447034,"text":"**Some more Homeworlds adjustments:**\n- For non-Firefox browsers, the ships are a little closer together, to further minimize wasted horizontal space. If something weird happens in Firefox, please let me know in the #bugs channel.\n- The global stash area has been made a little smaller and a little more compact.\n- If you click the Catastrophe button, you now only have to click once to choose both the system and the colour. Just select a star or ship in the affected system of the matching colour. Help text has been updated.\n- The new click handler will now behave as expected if you've selected a friendly ship and then hit the Sacrifice button. The Pass button now works as expected as well."},{"time":1687030503775,"text":"Because I can, I created a diagram generator for Homeworlds. For now, it's available here: https://www.abstractplay.com/_tools/renderer/homeworlds.html. It takes text input like the following and produces the SVG. Maybe this will be useful to someone out there. If so, let me know and I'll refine it further.\n```json\n{\n    \"numPlayers\": 2,\n    \"universe\": [\n        {\n            \"owner\": \"N\",\n            \"stars\": [\"G2\", \"B1\"],\n            \"ships\": [\"Y3N\"]\n        },\n        {\n            \"owner\": \"S\",\n            \"stars\": [\"G3\", \"R1\"],\n            \"ships\": [\"B3S\"]\n        },\n        {\n            \"stars\": [\"R3\"],\n            \"ships\": [\"Y1N\"]\n        }\n    ]\n}\n```"},{"time":1687098117555,"text":"Reiner Knizia's connect-4 game Complica now live. Enjoy!"},{"time":1687118869060,"text":"A few minor changes/improvements were just pushed to production:\n- User chats are now visible \"above the fold\" under the exploration window. The full log that includes move results is still below, but this will hopefully make it easier to keep on top of chats with fellow players.\n- You can now export a PNG of the game board, in any past or exploration state, by clicking the \"Download\" icon below the game board. The issue is that the PNG export is not aware of the styles that are applied to the SVG, so the fonts will be wrong, and this may lead to slightly odd layout sometimes. There are workarounds, but they are very intrusive. If you use this feature and come across a board state that's particularly egregious, let me know and I'll see what I can do, but hopefully this is good enough for most situations.\n- Some general bug fixes related to exploration and stash clicking are also included."},{"time":1687205911186,"text":"**Testers wanted for new game Robo Battle Pigs!** We're doing this one a little differently from SDG 1.0. We're going with the initial rules and only supporting up to four players. I've done basic testing, but I'd be grateful for any interested parties who would join the Dev server and try to break it. I'm particularly open to ways of improving the move annotations. Thank you!"},{"time":1687219103782,"text":"Chase has been fixed so that you can no longer bump pieces into the chamber. I apologize for the oversight. (May take a few minutes for the changes to appear.)"},{"time":1687281097041,"text":"Testers: The development environment might be a bit broken for the next few hours... Please be patient. I'll make an announcement when I think it is stable again."},{"time":1687293518866,"text":"Should be OK again. Let me know if you find issues!"},{"time":1687388598899,"text":"I think we may have finally, for reals this time, fixed the YourTurn notifications. If you notice incorrect counts, or if you're not getting the notifications you think you should be, please reach out!"},{"time":1687396650500,"text":"**Testers wanted for new game Wizard's Garden!** Another of the games we're migrating over from SDG 1.0. A pair of wizards vye to harvest reagents in a single garden plot. You play until no more planting is possible, and whoever harvested the most wins! Because lots can happen in a reversi-style game, I'm trialing a new approach. Each move is presented across four boards. The top-left shows the piece placement, the top-right shows the flipping, the bottom-left shows any harvests, and the bottom-right is where you actually make your move. I can't label the individual boards at this point, but hopefully it's sufficiently clear. The help text tries to be helpful. In any case, interested testers can come join me on the dev server and help me try to break it. Thank you!!"},{"time":1687464363294,"text":"The games Alien City, Fanorona, Pulling Strings, and Witch Stones are now available on the production server. Thank you, testers! Enjoy!"},{"time":1687606000418,"text":"**Testers wanted for new game Generatorb!** Generatorb is played on a chess board, corner to corner. Your goal is to land a piece on your opponent's corner or to control the majority of the spaces on the middle line. Pieces can stack up to three high, each with different movement rules. Interested testers can join me on the dev server to try to break it. Thank you!"},{"time":1687622240994,"text":"I'm trialing a new \"Your Turn\" indicator, which is a simple highlight of the \"Soandso to move\" line. It only appears in \"current\" mode, not exploration. Feedback welcome."},{"time":1687628072732,"text":"For screens 770px width and smaller (mobile), the chat window and the move tree are swapped. Let me know if you run into any difficulty."},{"time":1687650184318,"text":"**Testers wanted for new game Mixtour!** Yet another Dieter Stein game and winner of the MinD-Spielepreis 2013, Mixtour is a game of tower building with two main twists: (1) you can move your opponent's pieces and (2) move distance is determined by the height of the *target* stack and not the *moving* stack. Interested testers can join me on the dev server to try to break my code. As always, I am grateful for our testers!"},{"time":1687721450506,"text":"I've tweaked the CSS for the \"Accept Draw\" button to make it larger and a contrasting colour. Further tweaks will likely be necessary, but this is certainly better. ( @Nienna )"},{"time":1687721548960,"text":"There is now a traditional \"Pie Rule\" function we can apply to games. All it does is swap the players. It only applies to games we explicitly apply it to. Right now, that's just Zola and Monkey Queen. If there are other games where this rule should be enabled, let us know. Let us know if you run into any issues with it. ( @Mark Khan )"},{"time":1687732322139,"text":"**New game: Crossway!** I'm pleased to announce the availability of @Mark Khan 's connection game Crossway. You're both trying to connect opposite sides of the board, but you can't cross the streams! This is going straight into production because I'm pretty comfortable the single rule has been correctly implemented, but do let me know if there are any issues. And yes, the pie rule is enabled 🙂 Enjoy! (Also tagging @David Jonathan Bush)"},{"time":1687732417177,"text":"And just a note for the new folks that if you click the gear icon below any game board, you can change to a colour-blind-friendly palette, or to a black & white pattern palette, which actually works quite well for this game."},{"time":1687826349406,"text":"Nobody loves to win/lose by accident. In some games, that's easier to do than others. A \"Soandso is in check\" indicator has been added. It can only be applied to games (a) where we can generate a list of valid moves (so no Homeworlds) and (b) we can *efficiently* detect a \"check\" condition (so no Fabrik). Right now that includes the following games: Cannon, Lines of Action, Mixtour (in testing), Monkey Queen, and Generatorb (in testing). If there are other games where such an indicator would be helpful, feel free to let us know. If we can, we will, but we may tell you that it's not possible. For now, you just get bold text above the game board. We welcome ideas on improving things."},{"time":1687915055340,"text":"The games Focus, Wizard's Garden, and Robo Battle Pigs are now available on the production server. Testing was light, so do let me know if you run into any issues. Enjoy!"},{"time":1687915190531,"text":"Also, **testers wanted for new game Tintas!** Dieter Stein's game of colour collection is now available on the test server. Interested testers should join me there and try to break it! (Tagging @Leòdhais ) Thank you, testers!"},{"time":1688216921643,"text":"The games Mixtour, Tintas, and Generatorb are now available on the production server. Enjoy!!"},{"time":1688216925026,"text":"And thank you testers!"},{"time":1688226283331,"text":"**Testers wanted for new game Streetcar Suburb!** I'm pleased to announce the availability of @Drew Edwards (Coldsalmon) 's game Streetcar Suburb on the development server. Testers are welcome to come join us there to try to break it. It'll be in testing until I return from vacation. Thank you to all our testers, and thank you @Drew Edwards (Coldsalmon) for letting us host the game and for working with me on polishing it up. I think the final result is beautiful, and we've expanded the types of games we can now accommodate in the future. Mobile users will have to do some zooming and panning, though, for accurate edge selection. Thanks for playing with us!"},{"time":1688229749042,"text":"By way of reminder, testers can join us at https://play.dev.abstractplay.com. The accounts, game records, ratings, etc. are completely separate from the production server. Create an account (or multiple, if you want to play games against yourself) and feel free to challenge me to whatever games are being tested. Thank you in advance to all who donate some time to ensure the best quality code gets deployed."},{"time":1688229756464,"text":"Pinned a message."},{"time":1688247018465,"text":"I just pushed a working but still experimental \"star\" feature to production. We warmly welcome feedback and suggestions. From the games list, you can click the star icon to toggle it. You can then toggle showing only starred games on the page. When you create a new challenge, your starred games appear at the top of the list. That's the extent of the feature for now. Let me know if something doesn't work as you expect."},{"time":1688319777048,"text":"Because apparently I really don't want to pack, and because I'm going to miss all this typing while I'm away, I am pleased to announce the availability of @Mark Khan 's game King & Courtesan on the production server (https://www.marksteeregames.com/King_and_Courtesan_rules.pdf). I didn't feel testing was necessary in this case, but let me know if you run into any issues. In this game, your king moves freely among his courtesans as you try to invade your opponent's home square or capture the opposing king. Enjoy!"},{"time":1688331054801,"text":"In Wizard's Garden, the different boards are now labelled."},{"time":1688422346833,"text":"Thanks to extensive testing (thank you, testers!!), @Drew Edwards (Coldsalmon) is satisfied that Streetcar Suburb is ready for production release. It's available now. Enjoy!!"},{"time":1688482398603,"text":"There is now a new Volcano (and Mega-Volcano) display option:"},{"time":1688482442620,"text":"You can still use the original display if you prefer. Click on the gear icon below the board."},{"time":1689171913818,"text":"I've converted the Discord to a \"community\" server, which has enabled the forum features. I created a #game-specific-chat channel for persistent discussions around specific games. There's a very annoying 20-tag limit or I'd create a tag for every game. I hope this will change, and when it does, I will update the tags. But until then, you'll have to settle for tags for the first letter of the game's name. Enjoy!"},{"time":1689182106476,"text":"**Streetcar Suburb:** Lines just claimed are now dashed for easy identification."},{"time":1689185002770,"text":"The \"Game Over\" email has now been expanded. If you don't get an email when you expect it, or if something weird appears in the message, do let me know."},{"time":1689193749236,"text":"Losing the development blog. Discord will be the primary communications platform. Redirects (including a permanent `discord.abstractplay.com` alias) are propogating now, but it can take time for DNS servers to catch up. Let me know if weird things are happening to you even after a couple of hours."},{"time":1689278925552,"text":"A new \"Completed Games\" table version is now rolling out to production. Feedback welcome. It shows you when games were completed and when you last saw the game. If there's new chat in a closed game, then the game will appear in bold. Games will disappear from the \"completed\" list 48 hours after you last opened the game since it closed (so you'll want to open games that closed while you were away) and will reappear if new chat is entered after that window. Old games are always visible from the Completed Games list you get to from the main Games page. As always, let us know if something weird happens, and concrete suggestions for improvement are always welcome."},{"time":1689537607599,"text":"Also corrected the player display so it uses \"Player 1\" and \"Player 2\" instead of incorrectly assigning players colours. More ownership fixes are forthcoming."},{"time":1689541697759,"text":"**Testers wanted for new game Armadas!** (Tagging suggesters, @Nienna and @Samraku ). I know this isn't a more traditional abstract, but my inner math nerd wanted to play. More traditional fare is on the way. \n\nArmadas is a miniatures-style game of naval combat played with Looney pyramids. 2-4 commanders move their fleet on an open field trying to eliminate their opponents. These sorts of games tend to have a *lot* of house rules and add-ons. I'm certainly open to expanding this over time, but for now there are three scenarios: (1) the default is trio against trio, (2) there's also a \"two trio\" variant, and (3) the \"freeform\" variant lets players place as many pieces as they want until both players pass. This requires good-faith communication in advance.\n\nAnyway, interested testers can join us at https://play.dev.abstractplay.com and help me try to break it. Thanks!"},{"time":1689546384355,"text":"In games like Alien City, Streetcar Suburb, and Tintas, the player's name is now substituted in the areas below the board. I went with a fast and slightly dirty approach for efficiency's sake, so if something weird happens, do let me know. Still more ownership issues to resolve."},{"time":1689550463509,"text":"The fix to the last of the current ownership issues is rolling out now. Alien City now correctly shows which claim colour you are and places a bar next to the appropriate stash. I *believe* this is the last of this class of problem currently. If other issues arise, do let me know. Thanks!"},{"time":1689633415209,"text":"@Mark Khan 's \"dots and boxes\" style game Flume is now available on the production server. Let me know if you run into any trouble. Enjoy!"},{"time":1689701564218,"text":"For the record, we *think* we have solved the root cause of the \"not getting notifications\" issue. The database should self-correct when you next log in. If you continue to not receive notifications when you think you should, do let us know."},{"time":1689707362259,"text":"Ty Bomba's minimalist wargame Boom & Zoom is now available on the production server. Score by bearing your stacks off the opposing side, but you need to minimize your opponent's scoring opportunities as well. Enjoy!"},{"time":1689856990595,"text":"I've created a new \"implementation notes\" field for games that need them (currently Armadas, Chase, Entropy, Homeworlds, Lines of Action, Robo Battle Pigs, Taiji, Witch Stones, and Wizard's Garden). If a game you're playing has implementation notes, then the \"information\" icon below the game board will be highlighted. If you feel there are further notes needed, please let us know."},{"time":1689886063669,"text":"A new, tabular list of games is rolling into production as we speak. It supports filtering and sorting, and you can also issue challenges directly from there. This new format is easily expanded. I know there is more people would like to see (like game-specific \"tags\"), but we're not ready to go that far just yet. But more to come in this space, for sure. The names and numbers don't *look* clickable, but they are and take you to the same lists of games and ratings the old page took you to. Feedback and suggestions always welcome. Enjoy!"},{"time":1689891472673,"text":"I have finally added the original 8x8 board back into Lines of Action (tagging @alek ). I won't bore you with the long explanation, but in short, omitting it was a mistake that I won't make again. Because reasons, the 8x8 board is available as a variant. I know this is not ideal, but *fully* repairing my error was simply going to cost too much by way of time. Again, I'm sorry. It won't happen again. Enjoy!!"},{"time":1689972476104,"text":"When issuing an \"open\" or \"standing\" challenge, there is now a \"duration\" field. It defaults to `0`, which means that the challenge will remain active until you revoke it, no matter how many people accept it. But you can now change it to any number. After that many times people accept your challenge, the challenge will be automatically removed. So setting it to `1` means the challenge will expire once it is accepted the first time.\n\nFor reasons, this can only be extended to 2-player games. Maybe one day we'll find a way around that.\n\nI've done what testing I can, and everything appears to function correctly, but do let us know if something does not work as you expect or if you get some weird error. Thanks!"},{"time":1690058283283,"text":"I am *very* excited to announce the availability of browser push notifications. **Push notifications are 100% optional!** Each browser/device has its own process for allowing/blocking push notifications. If you aren't getting notifications, the first thing to do is check your browser's documentation. If you're getting notifications but they are \"weird\" in some way, do let us know.\n\nWe've tried to minimize the amount of spam. There are only four types of notification (game start, your turn, game end, challenges), and later instances of the same type will simply overwrite the earlier ones, so you'll never have more than four notifications active at one time. Clicking a notification will open the associated URL, focusing you on an existing tab if one exists. And if you receive a notification while already actively using the site, you'll instead get a \"toast\" notification in the top-right corner of the screen.\n\nThere is one drawback: activating these notifications brings along with it a bunch of progressive web app stuff that can interfere with getting the most recent versions of front-end code. In some cases, a hard refresh is not enough. You'll instead need to close all Abstract Play tabs and then reopen. I don't have a good sense of how problematic this will be. I guess we'll find out together! 🙂 Thank you for your patience. Bug reports and suggestions for improvement are always welcome."},{"time":1690135703073,"text":"At the designer's request, Streetcar Suburb has been updated to require drawing a second line if one is legal from your first line. Basically, it's never advantageous to intentionally skip drawing a line where possible. This does *not* preclude you from drawing a single line (usually deep in enemy territory) to get access to a set of buildings. Basically, you can draw your first line anywhere, and the system will only hold you up if a second line is legally possible. Hope that's clear 🙂 Let me know if you run into any issues."},{"time":1690146038342,"text":"I've moved the \"your turn\" and \"waiting for opponents\" tables on your dashboards to the new format. I've also added in an estimated time remaining on the clock for both tables (@Nienna). I know the \"Num moves\" field is not populating. Working on it 🙂 Once fixed, it will start populating once people make a move. Enjoy!"},{"time":1690206936509,"text":"I'm archiving the old #bugs channel for now (it's still visible at the bottom of the channel list) and have created a #bug-reports channel. This will hopefully keep the reports more organized and ensure the devs don't lose sight of important issues. For suggestions of new games and features, please continue to use the `/suggest` command. Thanks!"},{"time":1690235697164,"text":"**Homeworlds** – A number of changes have been pushed to production:\n- No more \"white screen of death\" when abandoning your home system temporarily. (@Samraku)\n- Kamikaze draws are now supported (in 2-player games only). (@Samraku)\n- Catastrophes can now be more easily triggered in the middle of a sacrifice chain. (@mneme)\n- The new click handler now registers a move when you click on a friendly ship followed by *any* ship or star in a different system. It used to only get triggered by clicking on the background. (@mneme)\n\nHomeworlds is the most complicated game we have. Although all unit tests and play testing have passed as expected, unintended consequences are always possible. Please let me know if anything weird happens.\n\nThanks to everybody who takes the time to report bugs and make suggestions for improvement. I appreciate your patience and willingness to engage in the process. Enjoy!"},{"time":1690374301970,"text":"The system already auto-rotates boards for certain games so the current player is at the bottom of the screen. Homeworlds does this too, but it hasn't lined up because of how the base render was orientated. While it really bothers the editor in me, I've altered the base render so North is at the bottom with ships pointing up, and then the auto-rotator should get things right from there. Let me know if it still doesn't, especially in 3 and 4 player games. For the record, in games that support rotation, once you rotate to where you want it, it should stay there throughout the game."},{"time":1690393962946,"text":"**New game: Clearcut!** I'm pleased to announce that @Mark Khan 's game Clearcut is now available on the production server. Let me know if you run into any issues. Enjoy!"},{"time":1690476580150,"text":"At the designer's request, I'm afraid we're taking Clearcut back down (the game is not finite). This situation has never arisen before. For now, I'm just marking the game as \"experimental\" so it will no longer be available on production. It *should* still let people finish existing games. At some point, we'll land on a \"best practice\" for this sort of situation. Let me know if you run into any issues."},{"time":1690641389249,"text":"Phutball is now available on the dev server!"},{"time":1690732033871,"text":"**Alfred's Wyke:** The used moves are now also filled. The lighter colour is the one that will become available next turn.,"},{"time":1690736180096,"text":"**Testers wanted for new game Bide!** @alek's game Bide is now available on the dev server. Testers are invited to come help us break it. I'm pretty comfortable that the core rules are correct, but I particularly would like to get a three-player game in with some releasing, just to make sure all the code is correct at higher player counts. Thank you, testers!"},{"time":1690747808495,"text":"The names of commenters who are not also participants in the game now display correctly. This involved some mild refactoring. My tests show everything working, but do let us know if something wonky happens with challenges in particular. Thanks!"},{"time":1690814935899,"text":"I'm very happy to announce the availability of @Drew Edwards (Coldsalmon)'s game Agere on the production server, including the \"Cobweb\" variant played on a radial board (our first such game, but hopefully not the last). Let us know if you run into any issues. Enjoy!"},{"time":1690830637797,"text":"After a minor rule change, @Mark Khan's Clearcut is back on the production server. See the updated rule sheet for details. Let me know if you run into any trouble."},{"time":1690832173345,"text":"Will appear above the game board, next to the game's name, if and only if the game is unrated. Rated is assumed. May take a couple minutes to appear."},{"time":1690838593016,"text":"Push notifications are now \"double opt-in.\" If you wish to continue to receive push notifications, please click the gear icon in the top-right of the screen and click \"Allow push notifications.\" Once you do that, your browser/device takes over, so you may receive another request for permission. Notifications will then continue as previously announced (https://discord.com/channels/526483743180062720/1111447982345298121/1132411258805702766). Disabling push notifications from the user settings screen will immediately deactivate our ability to send you notifications until you reenable them.\n\nPush notifications are 100% optional. It's just another way to be notified of changes in your games. Please let us know if you encounter any issues or if you have suggestions for how we can do these even better. Thanks for playing with us!"},{"time":1690856678266,"text":"As a last code push of the day, I'm putting out two \"tutorials\" for trial. The first time you visit your dashboard or the game play page after the push propagates, you will see a blue \"beacon\" (see screen capture). Clicking it will trigger a brief tutorial walking you through the different components of the page. You will only see it once per device unless you go into the user settings screen and uncheck the \"Hide Tutorials\" checkbox. I welcome feedback on how helpful you find the content and what improvements you think are needed. I want to make it easy for new players to \"get up to speed.\" The only hiccup I see so far is that on mobile, the last screen of each tutorial won't show (the one that talks about the user settings dialog) because the log in button is hidden on mobile by default. I will have to see if there's a way around this. \n\nThank you for participating in this beta period! We launched because we wanted feedback from actual players about the features they wanted to see, and you have done that in spades. Thank you for your great ideas and your patience as they get implemented."},{"time":1690940662752,"text":"All the remaining list tables (standing challenges, ratings, current/completed games) have been moved to the new format. I've done some testing and fixed any obvious issues, but do let me know if something isn't working as you expect. One thing: in the current/completed games lists, there will be some missing data in some cases (e.g., winners, variants). Those will populate correctly from here on out, but I haven't gone back and retroactively fixed things yet. I will, but there are other DB changes being considered that would render that work moot, so leaving it be for now. Thanks! (I am seeing some layout weirdness. Further tweaks are forthcoming, but at least now the main migration is done.)"},{"time":1691597645074,"text":"I've added a \"News\" page to the main site for those that just aren't interested in joining the Discord. This server remains the authoritative and most up-to-date source of information about the site. The list on the site is manually maintained, so will only contain more major announcements and may sometimes be behind."},{"time":1691601101671,"text":"I made a pretty fundamental change to how the backend applies moves and determines who the next player is. My tests show everything working as expected, but stuff happens. Please let me know if something does not work as you expect."},{"time":1692361090427,"text":"@Game Designer Between Baldur's Gate 3 sessions, I chipped away at a game designer playground that can be found at http://designer.abstractplay.com. It's rudimentary, but I'd be interested in your feedback. I need to add tiling at some point, but all the basic features are there. The restriction, of course, is that it's tied to the pieces and boards available in our rendering engine. I am open to feature requests. Enjoy."},{"time":1692410532345,"text":"@Game Designer, in particular @Drew Edwards (Coldsalmon): I have added peer-to-peer networking to the designer. If you don't need it, you can just collapse and ignore the networking stuff at the very top. I may find a way to hide it more fully if people find it truly irksome. For those that have said they will use it ( 👀 @Drew Edwards (Coldsalmon) ), it's relatively straightforward. Simply share your connection ID with friends. They enter that ID in their own browser and it will connect the two of you directly. You can then manually pass around a \"talking stick.\" Whoever has the talking stick is in control, and their game state is forcibly sent to everyone else. It's not particularly robust, but it seems to fundamentally work. I welcome suggestions and bug reports. If you have any questions, let me know."},{"time":1692410581677,"text":"Basically it works like the Zendo client I wrote, available on GitHub and on my personal website: https://www.perlkonig.com/zendo/."},{"time":1692410659665,"text":"I should clarify that there is no server involved here. This is truly peer-to-peer. You both connect to a central server to negotiate basic connection information, but after that, all communication is between the connected peers directly. There's no server running in the background."},{"time":1692410939921,"text":"And it's assumed that you'll actually be communicating with the other involved humans through some other means, like Discord or the like. There's no chat feature or anything like that. It just gets too involved."},{"time":1692569336594,"text":"Mirador is now available on the dev server!"},{"time":1692731981751,"text":"I finally dug deeper into the configuration of our user account provider. Confirmation and password reset emails will now come from the correct domain, and email confirmation is now done by link instead of code. So regardless of how long it takes for you to receive or act on the email, everything will work as expected. You are not able to log in until the email address is verified. Please let me know if you or someone you know is having problems accessing the site. We want the onboarding experience to be as smooth as possible."},{"time":1692967207344,"text":"Mirador and Phutball now live!"},{"time":1694295372125,"text":"Razzle Dazzle (also known as Knight Moves) and Dag en Nacht now live on the development server! Please report problems if you find them!"},{"time":1694893778564,"text":"Razzle Dazzle (also known as Knight Moves) and Dag en Nacht now live on the production server!"},{"time":1694893823555,"text":"Also, move submit confirmations. These can be turned off (to get back to the current behaviour) in your user settings."},{"time":1695061479480,"text":"It's with mixed emotions that I announce that the original Super Duper Games will be shutting down permanently as of Thursday, November 30th, 2023. I will be downloading all the game records starting Monday the 27th of November. I will maintain the domain name, and a permanent landing page will be set up that will list all the games and point people to the SDG archive, already available on my Google Drive (https://drive.google.com/drive/folders/0Bw8J0V9P_9hMeEJUSXE1LXRBN00?resourcekey=0-cklbEpjB9v8pAJ8C2nHRww&usp=sharing).\n\nIf your favourite game was not migrated, please submit a suggestion. Thank you to all the players who have been a part of the SDG community for these many years."},{"time":1695302192389,"text":"@Samraku is organizing an Adere tournament! See the following thread for details: https://discord.com/channels/526483743180062720/1154353344450670592"},{"time":1695485006825,"text":"The game Armadas is now on its way to the production server. There is still an issue with manually typing moves, but the game otherwise functions fine, and I want to get it out of testing. I will continue to \"chew on\" this manual input issue. Enjoy!"},{"time":1695504780196,"text":"I'm pleased to announce that @Mark Khan 's game Hexagonal Y is now available on the production server. Please let us know if you encounter any issues. Enjoy!"},{"time":1695644542148,"text":"@alek 's game Bide is now available on the production server, supporting 2–6 players. Enjoy!"},{"time":1696264791976,"text":"There have been a few incidents where games are not being properly concluded in the database. We are looking for the root cause. In the meantime, if you get the error `Unable to get user data for [long string of numbers and letters]`, please don't try to do anything with your account, like reset passwords or stuff like that. Simply file a bug report in the #bug-reports channel. It's a relatively minor fix. Hopefully we'll figure this out soon. Thanks for your patience."},{"time":1696547509671,"text":"A notes feature has now been added (@Avri (he/him) , @alek , @Samraku). Notes are private. Only you can see them. Notes are tied to games, not to individual moves. Notes disappear when a game concludes and is first cleared from your completed list. Because I had to pick a number, I've limited notes to 250 characters. That seems reasonable, but do let me know if it's too restrictive. Feedback on the UX is welcome."},{"time":1696547692131,"text":"I also now hide the \"rotate\" button below the board if the game is not flagged as needing rotation. For example, games like Cannon and Ordo are flagged as `perspective`, and the board is autoflipped for the second player. But games like Cephalopod and Streetcar Suburb are not, and so now the rotate button won't appear for those games. In an ideal world the rotation would work 100% of the time for all games, but for games with below-the-board areas, it doesn't work correctly. This seemed like a good middle ground for now."},{"time":1697061233244,"text":"My apologies to all note takers! I was not rigorous enough in my testing. The notes feature is now fixed, but it doesn't see existing notes. There was really no way around this. Notes are purged once a game ends. Let me know if there are further issues!"},{"time":1698206419403,"text":"Phil Leduc's game Murus Gallicus is now available on the production server. I'm pretty confident I've captured all the rules correctly, but it has been a long day 🙂 If you encounter any issues, please let me know right away and I'll try to salvage the game.\n\nIn discussion with Phil, with the goal of ensuring the \"best\" version of the game is the default, here's how things are configured:\n- The default ruleset is \"Advanced Murus Gallicus\" (with catapults).\n- By default, your first move is to redistribute one of your starting towers as walls on your second row.\n- The standard pie rule is also available.\n- There are three variants you can mix and match:\n  - \"Basic\" reverts the game to the \"no catapult\" state.\n  - \"Static\" disables the initial tower redistribution.\n  - \"Escape\" eliminates the breakthrough win condition.\n\nI should probably put that in the implementation notes, now that I think about it. Again, let me know if there are any issues. Enjoy!"},{"time":1698604099710,"text":"@Mark Khan's game Bounce is now available on the production server. Let me know if there are any issues. Enjoy!"},{"time":1699326585098,"text":"Records and analysis of completed games have now been made available. These records and statistics are not real time! They are generated every Sunday (6am UTC). \n- You can access all the records at https://records.abstractplay.com.\n- The new Statistics tab presents some analysis of the records.\n- Buttons for downloading all records, your records, and the records for specific games are visible on the Statistics page, your dashboard, and the completed games lists, respectively.\n\nI'll be doing some aesthetic tweaking later this week. We warmly welcome feedback and suggestions. Enjoy!"},{"time":1699550211737,"text":"Larger versions of the standard triangular Adere board are now available (@Drew Edwards (Coldsalmon), @Samraku). Enjoy!"},{"time":1699572635831,"text":"The clock and rated settings in the new challenge screen are now saved to your browser's \"local storage.\" That means the persistence is per device. For those that prefer different clock settings, hopefully this is a welcome change. Let me know if there are any issues."},{"time":1699815276569,"text":"Time controls are now explicitly visible on the game screen instead of only visible via tooltip. Also, the new challenge screen now has speed presets. The custom option is of course still available. This means a change to the default game clock. The default is now \"medium\" speed which is 2d/1d/4d (or roughly making a move at least twice a week). These settings are still persisted per device. Let us know if you run into any issues."},{"time":1699823165293,"text":"You can now explore variations in completed games and even annotate them. Here is an example\n    https://play.abstractplay.com/move/manalath/1/8703d405-c79d-4dd0-8e6c-ee54729a38b5?move=7&nodeid=d4b30785-eccb-4049-be84-cc9a97ebaba9\nNote that you can share the URL of a node somewhere in the tree. Make sure you turn on exploration. Move trees with comments are marked by a small comment icon. Just follow the icons untill you get to the comment.\nIf you were playing in a completed game, there should be a \"Publish exploration\" button. This can be used to publish the exploration you did during the game so that anyone can see it. Note that all completed game exploration and comments are visible to anyone.\n\nWhen there is a lot of exploration it might be a little slow in loading..."},{"time":1699927425693,"text":"Added some new stats and graphs to the Statistics page (it may take a few minutes to propagate):\n- On the Play Statistics table, a minimalist histogram of the number of completed games over the past 10 weeks is visible. If you click on the mini-graph, a full-size graph will appear with all of the data for that game.\n- A new \"Site statistics\" tab is available that gives you a histogram of all completed games on the site in seven-day \"buckets,\" and a new \"hours per move\" box plot will show you the spread of game speeds based on an average per game.\n- Finally, on the Games list table, there is now a \"recent\" column that gives the number of games completed in the past four weeks. This will give you a sense of what games are being played recently.\n\nLet me know if you see any issues or if you have feedback for other useful statistics you'd like to see. Enjoy!"},{"time":1700095639982,"text":"Added a couple more stats, because I'm a data nerd:\n- **Player statistics**: Added per-player graphs for the number of games completed in each seven-day period.\n- **Site statistics**: Added a cumulative \"first-time game completions\" graph that essentially shows user growth."},{"time":1700365728214,"text":"The solo playground is now available through the new Playground nav option. It leverages the built-in exploration function, so it only supports non-simultaneous games and only 2-player versions of games. You can also export any move state of any current or completed game to the playground. You only have one playground, and starting or importing a new game will replace the existing one. This feature is experimental. I've done basic testing, but it's possible there are edge cases that blow things up. Do let me know. Enjoy!"},{"time":1701008312546,"text":"I've added *h*-index to player stats. This index gives the number of games you've played at least that many times. So an *h*-index of 4 would mean you've played at least 4 different games at least 4 times each. If you've played all the games only one time each, then your *h*-index would still only be 1. The maximum *h*-index is the total number of games available on the site (56 right now, I believe)."},{"time":1701049427664,"text":"I'm pleased to announce the availability of @ManaT 's game Quagmire on the production server. @ManaT also coded this one for us—a first! Many thanks. Enjoy!"},{"time":1701129854426,"text":"After 18 years, the original Super Duper Games is now offline. There is a landing page up now that lists the games that used to be available (DNS propagation may take time depending on your area). I've maintained the local rules mirror as well. There's a link there to Abstract Play and a link to a publicly shared Google Drive folder that contains all the historical SDG data, including updated PGN game reports. Let me know if you encounter any issues with the site. If your favourite game didn't make it over, feel free to `/suggest` it. \n\nThe intent is for the landing page to be available \"indefinitely.\" The domain is paid up through 2025, so at least that long 🙂 \n\nMy sincerest thanks to all SDGers. I hope you will find a similar home here at Abstract Play. \n❤️"},{"time":1701741014666,"text":"**Testers wanted for new game Bao!** Bao is a sowing game from East Africa that I often hear called things like \"the king of Mancala games.\" It almost broke my brain, but thanks to the very patient @Nino , it's ready now for public testing. If you are willing to spend some time helping me iron out any final kinks, then please join us on the development server and challenge away. I'm of course interested in issues with the game itself, but I'm also interested in feedback on the board representation, which is new. Thank you to all testers! (See the pinned messages in this channel for instructions on how to join us on the dev server.)"},{"time":1702071405952,"text":"@pasxalis1987 's game AlmaTafl is now available on the production server. Let me know if you run into any issues. Enjoy!"},{"time":1702753052776,"text":"A few things have just rolled out:\n- **Last seen indicators:** When issuing a new challenge, you can restrict the list to those active in the past 7 or 30 days. On all lists where you can accept standing challenges, an indicator appears next to the challenger's name. Green means they've logged in in the past 7 days. Yellow means last 30 days. \n- **Player profiles:** *These are still very rudimentary at this point!* But you can now see a page of information on other players. Links appear in most lists, including chat logs. The page itself consists of multiple \"cards,\" the order of which you can change. I appreciate and encourage continued discussion of what you want to see here, and I will continue to adjust as I can. \n- **Country selection:** In the user settings screen (the cog in the top-right corner next to your username) you can now select the country you are playing from from a drop-down list. This is the only way we normalize the data entry. If your flag does not appear correctly on your profile page, please go into the settings and set it there. This is optional. You can set it to \"Prefer not to say,\" if you like.\n\nContinued feedback and suggestions welcome. Enjoy!"},{"time":1703094687833,"text":"The games Scaffold and Advanced Slither are now available on the production server. A huge thank you to @ypaul for coding these two games for us! Enjoy!"},{"time":1703258114229,"text":"Experiment time! Players may now add tags to the game table on the Games page. Your tags are publicly visible, so not everybody needs to create all the tags. Duplicates are ignored. The single search field also searches tags. Let me know if you run into any issues."},{"time":1703429580015,"text":"@Mark Khan 's game Byte is now available on the production server. Enjoy!"},{"time":1703456045940,"text":"Michael Amundsen and @alek 's game Lielow is now available on the production server. Again, many thanks to @ypaul for coding this one for us. Enjoy!"},{"time":1703458798632,"text":"And to round out the Christmas hat trick, the East African game Bao is now available on the production server. A huge thank you to the patient and persistent efforts of our testers, in particular @Samraku  and @Nino. This is one of the more complicated games on the server (top-three, methinks), so there are bound to be hiccups. Let me know if you run into any issues. But thanks to our testers and their excellent suggestions, I think the game is in a good place. Enjoy!"},{"time":1703461296354,"text":"Oh, and a note about Bao and all future sowing games: if you click the cog icon under the game board, you can switch to a pip view instead of a numeric view:"},{"time":1703530473588,"text":"The central Asian mancala-style game Toguz Kumalak is now available on the production server. Enjoy!"},{"time":1703604006076,"text":"And @ypaul is keeping the holiday cornucopia flowing with the addition of @alek 's game Trike. It's now available on the production server. Enjoy!"},{"time":1703735722765,"text":"Thanks to the prolific @ypaul , the impossibly named game Iqishiqi is now available on the production server. I know it has been a fire hose lately, but I hope these new games will keep you busy over the last of the holidays. I'm sure things will slow down once the day jobs start banging at our doors again. Enjoy!"},{"time":1703784135165,"text":"TLDR: You can now customize the player colours. Go to the main settings screen (the cog next to your username) and click the button Manage Palettes. Create as many palettes as you want. Then go to a particular game you want to customize and click the cog icon below the game board. Apply the desired palette.\n\nAnd now some context:\n- Most colours in most games are assigned by number. A palette simply provides custom colours for each of the player numbers.\n- This will also affect properly assigned markers and annotations.\n- Custom colours only affect *your* experience. Nobody else is affected.\n- This will not work for all games! Some (like Wizard's Garden) are hard coded. And others (like Streetcar Suburb) use arbitrary colours from the palette and are not in typical player order. Some experimentation may be required. If you encounter trouble or have questions, do reach out.\n- Creating a palette with the same name as an existing one will overwrite it.\n- If you delete a palette that is assigned to a game, the game will revert to the standard palette.\n- Finally, I am *certain* there is some edge case I am missing that will blow a game up. If something goes horribly wrong, just let us know.\n\nEnjoy!"},{"time":1703894517984,"text":"Completing a mancala trifecta, @Mark Khan 's game Diffusion is now available on the production server. Enjoy!"},{"time":1703904468463,"text":"Stephen Tavener's game Furl is now available on the production server, thanks again to @ypaul. Enjoy!"},{"time":1704148642563,"text":"Some experimental customization features were just pushed to production:\n- There is now a global dark mode available. Simply click the button next to your username. Your selection is saved per device. I am open to feedback on how to improve it, but know that there is no \"one right way\" when it comes to front ends. But I will do my best to maximize its value.\n- You can now customize the appearance of your game boards using CSS. This is an advanced feature and is not without risk. Never inject code you either do not understand yourself or has not been vetted by someone you trust. I'm creating a new Discord channel specifically for discussions around customization. Join us there for more information (#customization).\n\nI've also added links in the footer to the official BGG list of games available here and to a new wiki. Enjoy!"},{"time":1704148711435,"text":"And @ypaul continues his streak of awesomeness to bring to us all the game Havannah! Compete to surround at least one cell, connect two corners, or bridge three sides. Enjoy!"},{"time":1704300198413,"text":"The oldie but goodie Hex is now available on the production server. Thanks again to @ypaul for coding this one for us. Enjoy!"},{"time":1704303334430,"text":"UI change on the way to the production server. The playground now has a \"Random Move\" button if you just want to play with the rules (obviously only works for games that generate move lists). A \"Pass\" button now appears next to the move selection drop down (a) if that game generates a move list and (b) \"pass\" appears in that move list. You still need to click \"Submit\" after clicking \"Pass.\" Let me know if there are any issues."},{"time":1704304978069,"text":"And thanks again to @ypaul, the popular \"new\" abstract Tumbleweed is now available on the production server. Make time for games, people! There's a lot of 'em! 🙂"},{"time":1704315699943,"text":"To prevent hard errors when creating a palette with an insufficient number of colours, small palettes are automatically topped up with white. So if you find yourself in a game with a bunch of white pieces, it's because the palette you assigned to that game didn't have enough colours. Let me know if you run into any further issues."}]
