[{"time":1685061834730,"text":"Going to start moving announcements and bug-updates to this clean channel, just to make sure they can be seen. Thank you for your patience as we try to make the server more useful. Your suggestions are always welcome."},{"time":1685066578531,"text":"**Homeworlds:** Fixed a bug that kept some sacrifice moves from completing properly. Also tweaked some of the help text to be more...helpful. Also added a CATASTROPHE button. You can still click on the background of a system to trigger a catastrophe, but that wasn't particularly intuitive. We remain committed to making things as intuitive as possible. Your feedback is warmly welcomed. The most consistent lesson of my professional life has been that what's obvious to one person is likely not obvious to another!"},{"time":1685066602185,"text":"The issue with the Homeworlds click handler in Firefox is still being worked on. We at least know what's causing it. Hopefully we can work around it. Firefox always does things differently!"},{"time":1685125093695,"text":"**Homeworlds**: The click handler has been fixed to work with Firefox. Thank you for your patience! Fixes for Volcano power moves are forthcoming."},{"time":1685130791874,"text":"Volcano: Power plays should now be clickable in Firefox. Hover should now correctly show the stack on the side even during partial moves (including power plays). The stash labels shouldn't be getting truncated anymore. I had to clear my JavaScript cache for the change to show."},{"time":1685382584578,"text":"**Testers wanted for new game Realm!** This is the first time we've added a game since going live, so let me explain how this works. If you want to help with the testing, please visit <https://play.dev.abstractplay.com> and create an account. (The user accounts, game records, ratings—everything—are completely separate from the production server.) Then start some games and intentionally try to break it! I will accept all challenges. Please report any issues. Once I'm comfortable the code is correct and stable, we'll move it over to the production server. Thanks in advance for the help!"},{"time":1685382603493,"text":"Tagging @Nienna  and @Mobynostromo , who are, I believe, our resident Realm experts."},{"time":1685833469075,"text":"**Testers wanted for new game Alien City!** The rules for this game can be a little confusing, and I would be shocked if I didn't make some mistake somewhere. But my basic testing is showing things as working as I expect, which again, may not be correct 🙂 I would be grateful if Alien City lovers could dive in and do some testing on the Dev server, as described above. Thanks for the help!"},{"time":1685833481975,"text":"Tagging @Nienna , who formally requested I transfer the game."},{"time":1685835830544,"text":"I notice it's running a little slow in the live environment. It needn't stop people from testing. It gets more responsive as the board fills up. I am working on efficiency."},{"time":1685906360929,"text":"This Homeworlds change is a tweak to the build command click handler. You can now click directly on the ship you wish to duplicate."},{"time":1686170187564,"text":"**Testers wanted for new game Fanorona!** Suggested by @eykca and existing on SDG 1.0, it is now available for testing. Interested parties should create an account on the dev server (https://play.dev.abstractplay.com) and try to break it. I'll accept all challenges. Thank you!"},{"time":1686247755375,"text":"**New game Realm now live!** Thank you to all our testers!"},{"time":1686255804181,"text":"**Testers wanted for new game Focus!** Interested parties should create an account on the dev server (https://play.dev.abstractplay.com) and try to break it. I'll accept all challenges. Thank you!! (Tagging @dx  and @tommynomad , who requested the game.)"},{"time":1686263596214,"text":"I'll note that I slightly altered the notation since SDG 1.0. When placing a piece from your hand, you prefix the cell with a plus sign (e.g., `+d4`)."},{"time":1686266966511,"text":"I just got a suggestion for Zendo (thank you, @Benedek). I love Zendo, but it simply won't work in the infrastructure we've built here. If I can come up with a way, I will. I promise. But let me take this opportunity (a) to point people to the excellent Zendo Discord channel (https://discord.gg/gdmwPMuTyb) and (b) to point people to the *synchronous*, live-play Zendo client that I wrote a little while back: GitHub (https://github.com/AbstractPlay/zendo), **playable version** (https://www.perlkonig.com/zendo/). Just thought I'd put that one to bed for now. But please continue to suggest games you love! I'm typing like a maniac over here, as the four new games being tested attest. Thanks for playing!"},{"time":1686348036753,"text":"Homeworlds has been fixed so you can trigger catastrophes at any point in your turn. I've done what testing I can, but Homeworlds is very complicated code. Let me know if something doesn't work as expected."},{"time":1686419820062,"text":"The Homeworlds click handler has been adjusted to make use of sacrifice actions simpler. If you have remaining actions of a particular colour, the move box will autofill with the appropriate keyword. Clicking the Pass button will correctly clear the partial entry. My testing shows things functioning as I expect, but again, this is complicated code. Let me know if something isn't working as you expect. (Tagging @mneme, who indirectly gave me the idea for this change.)"},{"time":1686419856835,"text":"We warmly welcome concrete suggestions on how to make the click handling and gameplay more intuitive for all the games, but especially the more complicated, multi-move ones like Homeworlds."},{"time":1686596808342,"text":"**Testers wanted for new game Pulling Strings!** This one is a simultaneous action selection game where you pull strings along the outside edge of the board to manoeuvre five or more coins onto your home spaces. This is one of those \"get into your opponent's head\" games that can be infuriating and fun at the same time. Please come join us on the dev server and help me make sure things are working as intended."},{"time":1686596881849,"text":"By way of reminder, the following games are in testing: Alien City, Fanorona, Focus, and now Pulling Strings. Thank you to our testers!"},{"time":1686694125430,"text":"**Testers wanted for new game Witch Stones!** The migration blitz continues. In this game, four types of pieces randomly fill a board, and players take turns removing stones and scoring points. First to 50 wins! Interested parties can join us on the dev server to try to break things. Thank you, testers!"},{"time":1686694341693,"text":"I have a soft goal of completing the SDG 1.0 migration and fully decommissioning it by the end of this year. I'm down to about a dozen games left that I think really should move over (I started with a list of 50), but I'll seriously consider *any* SDG 1.0 game that someone explicitly requests. So if you have a favourite that you want to make sure survives, please use the `/suggest` command to have it added to the list."},{"time":1686757949829,"text":"I pushed changes (hopefully fixes) to the Your Turn notification code, so I apologize for the double emails. I'm sure there's still something not quite right, so please continue to report issues and I'll see what I can track down. A reminder that you won't get emails from us unless your email address was verified when you created your account. If you're not getting emails at all, let me know in DM and I'll see what we can track down. Thanks for your patience."},{"time":1686841596609,"text":"New, more compact Homeworlds renderer is being pushed to production as we speak. I am certain more tweaks will be needed, but I think it's a solid enough improvement to roll out immediately. Nothing else has changed yet. Simplifying the click handler is the next step. I warmly welcome feedback on how to improve things further. Thank you! (Tagging @mneme , @hoembla , and @ManaT )"},{"time":1686875171300,"text":"**New Homeworlds click handler now active.** Thank you all Homeworlds players, and in particular @mneme , for your concrete suggestions about how to improve the Homeworlds experience. A new click handler is now available alongside the old one. The old one only gets triggered if you're entering moves in a combination of typing and clicking or if you're continuing a string of sacrifice moves. Most moves, however, are now reduced to 1 to 3 clicks, as follows:\n```txt\nenemy -> ATTACK\nfriendly > same friendly -> BUILD\nfriendly > stash -> TRADE\nfriendly > system -> MOVE\nfriendly > VOID (the space between systems) > stash -> DISCOVER\n```\n\nThe help text has been similarly updated. I've done a fair bit of testing, but there are always edge cases. Please let me know if you run into any trouble, and I remain open to further discussion on how to make things better. Thanks for playing with us!"},{"time":1687027447034,"text":"**Some more Homeworlds adjustments:**\n- For non-Firefox browsers, the ships are a little closer together, to further minimize wasted horizontal space. If something weird happens in Firefox, please let me know in the #bugs channel.\n- The global stash area has been made a little smaller and a little more compact.\n- If you click the Catastrophe button, you now only have to click once to choose both the system and the colour. Just select a star or ship in the affected system of the matching colour. Help text has been updated.\n- The new click handler will now behave as expected if you've selected a friendly ship and then hit the Sacrifice button. The Pass button now works as expected as well."},{"time":1687030503775,"text":"Because I can, I created a diagram generator for Homeworlds. For now, it's available here: https://www.abstractplay.com/_tools/renderer/homeworlds.html. It takes text input like the following and produces the SVG. Maybe this will be useful to someone out there. If so, let me know and I'll refine it further.\n```json\n{\n    \"numPlayers\": 2,\n    \"universe\": [\n        {\n            \"owner\": \"N\",\n            \"stars\": [\"G2\", \"B1\"],\n            \"ships\": [\"Y3N\"]\n        },\n        {\n            \"owner\": \"S\",\n            \"stars\": [\"G3\", \"R1\"],\n            \"ships\": [\"B3S\"]\n        },\n        {\n            \"stars\": [\"R3\"],\n            \"ships\": [\"Y1N\"]\n        }\n    ]\n}\n```"},{"time":1687098117555,"text":"Reiner Knizia's connect-4 game Complica now live. Enjoy!"},{"time":1687118869060,"text":"A few minor changes/improvements were just pushed to production:\n- User chats are now visible \"above the fold\" under the exploration window. The full log that includes move results is still below, but this will hopefully make it easier to keep on top of chats with fellow players.\n- You can now export a PNG of the game board, in any past or exploration state, by clicking the \"Download\" icon below the game board. The issue is that the PNG export is not aware of the styles that are applied to the SVG, so the fonts will be wrong, and this may lead to slightly odd layout sometimes. There are workarounds, but they are very intrusive. If you use this feature and come across a board state that's particularly egregious, let me know and I'll see what I can do, but hopefully this is good enough for most situations.\n- Some general bug fixes related to exploration and stash clicking are also included."},{"time":1687205911186,"text":"**Testers wanted for new game Robo Battle Pigs!** We're doing this one a little differently from SDG 1.0. We're going with the initial rules and only supporting up to four players. I've done basic testing, but I'd be grateful for any interested parties who would join the Dev server and try to break it. I'm particularly open to ways of improving the move annotations. Thank you!"},{"time":1687219103782,"text":"Chase has been fixed so that you can no longer bump pieces into the chamber. I apologize for the oversight. (May take a few minutes for the changes to appear.)"},{"time":1687281097041,"text":"Testers: The development environment might be a bit broken for the next few hours... Please be patient. I'll make an announcement when I think it is stable again."},{"time":1687293518866,"text":"Should be OK again. Let me know if you find issues!"},{"time":1687388598899,"text":"I think we may have finally, for reals this time, fixed the YourTurn notifications. If you notice incorrect counts, or if you're not getting the notifications you think you should be, please reach out!"},{"time":1687396650500,"text":"**Testers wanted for new game Wizard's Garden!** Another of the games we're migrating over from SDG 1.0. A pair of wizards vye to harvest reagents in a single garden plot. You play until no more planting is possible, and whoever harvested the most wins! Because lots can happen in a reversi-style game, I'm trialing a new approach. Each move is presented across four boards. The top-left shows the piece placement, the top-right shows the flipping, the bottom-left shows any harvests, and the bottom-right is where you actually make your move. I can't label the individual boards at this point, but hopefully it's sufficiently clear. The help text tries to be helpful. In any case, interested testers can come join me on the dev server and help me try to break it. Thank you!!"},{"time":1687464363294,"text":"The games Alien City, Fanorona, Pulling Strings, and Witch Stones are now available on the production server. Thank you, testers! Enjoy!"},{"time":1687606000418,"text":"**Testers wanted for new game Generatorb!** Generatorb is played on a chess board, corner to corner. Your goal is to land a piece on your opponent's corner or to control the majority of the spaces on the middle line. Pieces can stack up to three high, each with different movement rules. Interested testers can join me on the dev server to try to break it. Thank you!"},{"time":1687622240994,"text":"I'm trialing a new \"Your Turn\" indicator, which is a simple highlight of the \"Soandso to move\" line. It only appears in \"current\" mode, not exploration. Feedback welcome."},{"time":1687628072732,"text":"For screens 770px width and smaller (mobile), the chat window and the move tree are swapped. Let me know if you run into any difficulty."},{"time":1687650184318,"text":"**Testers wanted for new game Mixtour!** Yet another Dieter Stein game and winner of the MinD-Spielepreis 2013, Mixtour is a game of tower building with two main twists: (1) you can move your opponent's pieces and (2) move distance is determined by the height of the *target* stack and not the *moving* stack. Interested testers can join me on the dev server to try to break my code. As always, I am grateful for our testers!"},{"time":1687721450506,"text":"I've tweaked the CSS for the \"Accept Draw\" button to make it larger and a contrasting colour. Further tweaks will likely be necessary, but this is certainly better. ( @Nienna )"},{"time":1687721548960,"text":"There is now a traditional \"Pie Rule\" function we can apply to games. All it does is swap the players. It only applies to games we explicitly apply it to. Right now, that's just Zola and Monkey Queen. If there are other games where this rule should be enabled, let us know. Let us know if you run into any issues with it. ( @Mark Khan )"},{"time":1687732322139,"text":"**New game: Crossway!** I'm pleased to announce the availability of @Mark Khan 's connection game Crossway. You're both trying to connect opposite sides of the board, but you can't cross the streams! This is going straight into production because I'm pretty comfortable the single rule has been correctly implemented, but do let me know if there are any issues. And yes, the pie rule is enabled 🙂 Enjoy! (Also tagging @David Jonathan Bush)"},{"time":1687732417177,"text":"And just a note for the new folks that if you click the gear icon below any game board, you can change to a colour-blind-friendly palette, or to a black & white pattern palette, which actually works quite well for this game."},{"time":1687826349406,"text":"Nobody loves to win/lose by accident. In some games, that's easier to do than others. A \"Soandso is in check\" indicator has been added. It can only be applied to games (a) where we can generate a list of valid moves (so no Homeworlds) and (b) we can *efficiently* detect a \"check\" condition (so no Fabrik). Right now that includes the following games: Cannon, Lines of Action, Mixtour (in testing), Monkey Queen, and Generatorb (in testing). If there are other games where such an indicator would be helpful, feel free to let us know. If we can, we will, but we may tell you that it's not possible. For now, you just get bold text above the game board. We welcome ideas on improving things."},{"time":1687915055340,"text":"The games Focus, Wizard's Garden, and Robo Battle Pigs are now available on the production server. Testing was light, so do let me know if you run into any issues. Enjoy!"},{"time":1687915190531,"text":"Also, **testers wanted for new game Tintas!** Dieter Stein's game of colour collection is now available on the test server. Interested testers should join me there and try to break it! (Tagging @Leòdhais ) Thank you, testers!"},{"time":1688216921643,"text":"The games Mixtour, Tintas, and Generatorb are now available on the production server. Enjoy!!"},{"time":1688216925026,"text":"And thank you testers!"},{"time":1688226283331,"text":"**Testers wanted for new game Streetcar Suburb!** I'm pleased to announce the availability of @Drew Edwards (Coldsalmon) 's game Streetcar Suburb on the development server. Testers are welcome to come join us there to try to break it. It'll be in testing until I return from vacation. Thank you to all our testers, and thank you @Drew Edwards (Coldsalmon) for letting us host the game and for working with me on polishing it up. I think the final result is beautiful, and we've expanded the types of games we can now accommodate in the future. Mobile users will have to do some zooming and panning, though, for accurate edge selection. Thanks for playing with us!"},{"time":1688229749042,"text":"By way of reminder, testers can join us at https://play.dev.abstractplay.com. The accounts, game records, ratings, etc. are completely separate from the production server. Create an account (or multiple, if you want to play games against yourself) and feel free to challenge me to whatever games are being tested. Thank you in advance to all who donate some time to ensure the best quality code gets deployed."},{"time":1688229756464,"text":"Pinned a message."},{"time":1688247018465,"text":"I just pushed a working but still experimental \"star\" feature to production. We warmly welcome feedback and suggestions. From the games list, you can click the star icon to toggle it. You can then toggle showing only starred games on the page. When you create a new challenge, your starred games appear at the top of the list. That's the extent of the feature for now. Let me know if something doesn't work as you expect."},{"time":1688319777048,"text":"Because apparently I really don't want to pack, and because I'm going to miss all this typing while I'm away, I am pleased to announce the availability of @Mark Khan 's game King & Courtesan on the production server (https://www.marksteeregames.com/King_and_Courtesan_rules.pdf). I didn't feel testing was necessary in this case, but let me know if you run into any issues. In this game, your king moves freely among his courtesans as you try to invade your opponent's home square or capture the opposing king. Enjoy!"},{"time":1688331054801,"text":"In Wizard's Garden, the different boards are now labelled."},{"time":1688422346833,"text":"Thanks to extensive testing (thank you, testers!!), @Drew Edwards (Coldsalmon) is satisfied that Streetcar Suburb is ready for production release. It's available now. Enjoy!!"},{"time":1688482398603,"text":"There is now a new Volcano (and Mega-Volcano) display option:"},{"time":1688482442620,"text":"You can still use the original display if you prefer. Click on the gear icon below the board."},{"time":1689171913818,"text":"I've converted the Discord to a \"community\" server, which has enabled the forum features. I created a #game-specific-chat channel for persistent discussions around specific games. There's a very annoying 20-tag limit or I'd create a tag for every game. I hope this will change, and when it does, I will update the tags. But until then, you'll have to settle for tags for the first letter of the game's name. Enjoy!"},{"time":1689182106476,"text":"**Streetcar Suburb:** Lines just claimed are now dashed for easy identification."},{"time":1689185002770,"text":"The \"Game Over\" email has now been expanded. If you don't get an email when you expect it, or if something weird appears in the message, do let me know."},{"time":1689193749236,"text":"Losing the development blog. Discord will be the primary communications platform. Redirects (including a permanent `discord.abstractplay.com` alias) are propogating now, but it can take time for DNS servers to catch up. Let me know if weird things are happening to you even after a couple of hours."},{"time":1689278925552,"text":"A new \"Completed Games\" table version is now rolling out to production. Feedback welcome. It shows you when games were completed and when you last saw the game. If there's new chat in a closed game, then the game will appear in bold. Games will disappear from the \"completed\" list 48 hours after you last opened the game since it closed (so you'll want to open games that closed while you were away) and will reappear if new chat is entered after that window. Old games are always visible from the Completed Games list you get to from the main Games page. As always, let us know if something weird happens, and concrete suggestions for improvement are always welcome."},{"time":1689537607599,"text":"Also corrected the player display so it uses \"Player 1\" and \"Player 2\" instead of incorrectly assigning players colours. More ownership fixes are forthcoming."},{"time":1689541697759,"text":"**Testers wanted for new game Armadas!** (Tagging suggesters, @Nienna and @Samraku ). I know this isn't a more traditional abstract, but my inner math nerd wanted to play. More traditional fare is on the way. \n\nArmadas is a miniatures-style game of naval combat played with Looney pyramids. 2-4 commanders move their fleet on an open field trying to eliminate their opponents. These sorts of games tend to have a *lot* of house rules and add-ons. I'm certainly open to expanding this over time, but for now there are three scenarios: (1) the default is trio against trio, (2) there's also a \"two trio\" variant, and (3) the \"freeform\" variant lets players place as many pieces as they want until both players pass. This requires good-faith communication in advance.\n\nAnyway, interested testers can join us at https://play.dev.abstractplay.com and help me try to break it. Thanks!"},{"time":1689546384355,"text":"In games like Alien City, Streetcar Suburb, and Tintas, the player's name is now substituted in the areas below the board. I went with a fast and slightly dirty approach for efficiency's sake, so if something weird happens, do let me know. Still more ownership issues to resolve."},{"time":1689550463509,"text":"The fix to the last of the current ownership issues is rolling out now. Alien City now correctly shows which claim colour you are and places a bar next to the appropriate stash. I *believe* this is the last of this class of problem currently. If other issues arise, do let me know. Thanks!"},{"time":1689633415209,"text":"@Mark Khan 's \"dots and boxes\" style game Flume is now available on the production server. Let me know if you run into any trouble. Enjoy!"},{"time":1689701564218,"text":"For the record, we *think* we have solved the root cause of the \"not getting notifications\" issue. The database should self-correct when you next log in. If you continue to not receive notifications when you think you should, do let us know."},{"time":1689707362259,"text":"Ty Bomba's minimalist wargame Boom & Zoom is now available on the production server. Score by bearing your stacks off the opposing side, but you need to minimize your opponent's scoring opportunities as well. Enjoy!"},{"time":1689856990595,"text":"I've created a new \"implementation notes\" field for games that need them (currently Armadas, Chase, Entropy, Homeworlds, Lines of Action, Robo Battle Pigs, Taiji, Witch Stones, and Wizard's Garden). If a game you're playing has implementation notes, then the \"information\" icon below the game board will be highlighted. If you feel there are further notes needed, please let us know."},{"time":1689886063669,"text":"A new, tabular list of games is rolling into production as we speak. It supports filtering and sorting, and you can also issue challenges directly from there. This new format is easily expanded. I know there is more people would like to see (like game-specific \"tags\"), but we're not ready to go that far just yet. But more to come in this space, for sure. The names and numbers don't *look* clickable, but they are and take you to the same lists of games and ratings the old page took you to. Feedback and suggestions always welcome. Enjoy!"},{"time":1689891472673,"text":"I have finally added the original 8x8 board back into Lines of Action (tagging @bael ). I won't bore you with the long explanation, but in short, omitting it was a mistake that I won't make again. Because reasons, the 8x8 board is available as a variant. I know this is not ideal, but *fully* repairing my error was simply going to cost too much by way of time. Again, I'm sorry. It won't happen again. Enjoy!!"},{"time":1689972476104,"text":"When issuing an \"open\" or \"standing\" challenge, there is now a \"duration\" field. It defaults to `0`, which means that the challenge will remain active until you revoke it, no matter how many people accept it. But you can now change it to any number. After that many times people accept your challenge, the challenge will be automatically removed. So setting it to `1` means the challenge will expire once it is accepted the first time.\n\nFor reasons, this can only be extended to 2-player games. Maybe one day we'll find a way around that.\n\nI've done what testing I can, and everything appears to function correctly, but do let us know if something does not work as you expect or if you get some weird error. Thanks!"},{"time":1690058283283,"text":"I am *very* excited to announce the availability of browser push notifications. **Push notifications are 100% optional!** Each browser/device has its own process for allowing/blocking push notifications. If you aren't getting notifications, the first thing to do is check your browser's documentation. If you're getting notifications but they are \"weird\" in some way, do let us know.\n\nWe've tried to minimize the amount of spam. There are only four types of notification (game start, your turn, game end, challenges), and later instances of the same type will simply overwrite the earlier ones, so you'll never have more than four notifications active at one time. Clicking a notification will open the associated URL, focusing you on an existing tab if one exists. And if you receive a notification while already actively using the site, you'll instead get a \"toast\" notification in the top-right corner of the screen.\n\nThere is one drawback: activating these notifications brings along with it a bunch of progressive web app stuff that can interfere with getting the most recent versions of front-end code. In some cases, a hard refresh is not enough. You'll instead need to close all Abstract Play tabs and then reopen. I don't have a good sense of how problematic this will be. I guess we'll find out together! 🙂 Thank you for your patience. Bug reports and suggestions for improvement are always welcome."},{"time":1690135703073,"text":"At the designer's request, Streetcar Suburb has been updated to require drawing a second line if one is legal from your first line. Basically, it's never advantageous to intentionally skip drawing a line where possible. This does *not* preclude you from drawing a single line (usually deep in enemy territory) to get access to a set of buildings. Basically, you can draw your first line anywhere, and the system will only hold you up if a second line is legally possible. Hope that's clear 🙂 Let me know if you run into any issues."},{"time":1690146038342,"text":"I've moved the \"your turn\" and \"waiting for opponents\" tables on your dashboards to the new format. I've also added in an estimated time remaining on the clock for both tables (@Nienna). I know the \"Num moves\" field is not populating. Working on it 🙂 Once fixed, it will start populating once people make a move. Enjoy!"},{"time":1690206936509,"text":"I'm archiving the old #bugs channel for now (it's still visible at the bottom of the channel list) and have created a #bug-reports channel. This will hopefully keep the reports more organized and ensure the devs don't lose sight of important issues. For suggestions of new games and features, please continue to use the `/suggest` command. Thanks!"},{"time":1690235697164,"text":"**Homeworlds** – A number of changes have been pushed to production:\n- No more \"white screen of death\" when abandoning your home system temporarily. (@Samraku)\n- Kamikaze draws are now supported (in 2-player games only). (@Samraku)\n- Catastrophes can now be more easily triggered in the middle of a sacrifice chain. (@mneme)\n- The new click handler now registers a move when you click on a friendly ship followed by *any* ship or star in a different system. It used to only get triggered by clicking on the background. (@mneme)\n\nHomeworlds is the most complicated game we have. Although all unit tests and play testing have passed as expected, unintended consequences are always possible. Please let me know if anything weird happens.\n\nThanks to everybody who takes the time to report bugs and make suggestions for improvement. I appreciate your patience and willingness to engage in the process. Enjoy!"},{"time":1690374301970,"text":"The system already auto-rotates boards for certain games so the current player is at the bottom of the screen. Homeworlds does this too, but it hasn't lined up because of how the base render was orientated. While it really bothers the editor in me, I've altered the base render so North is at the bottom with ships pointing up, and then the auto-rotator should get things right from there. Let me know if it still doesn't, especially in 3 and 4 player games. For the record, in games that support rotation, once you rotate to where you want it, it should stay there throughout the game."},{"time":1690393962946,"text":"**New game: Clearcut!** I'm pleased to announce that @Mark Khan 's game Clearcut is now available on the production server. Let me know if you run into any issues. Enjoy!"},{"time":1690476580150,"text":"At the designer's request, I'm afraid we're taking Clearcut back down (the game is not finite). This situation has never arisen before. For now, I'm just marking the game as \"experimental\" so it will no longer be available on production. It *should* still let people finish existing games. At some point, we'll land on a \"best practice\" for this sort of situation. Let me know if you run into any issues."},{"time":1690641389249,"text":"Phutball is now available on the dev server!"},{"time":1690732033871,"text":"**Alfred's Wyke:** The used moves are now also filled. The lighter colour is the one that will become available next turn.,"},{"time":1690736180096,"text":"**Testers wanted for new game Bide!** @bael's game Bide is now available on the dev server. Testers are invited to come help us break it. I'm pretty comfortable that the core rules are correct, but I particularly would like to get a three-player game in with some releasing, just to make sure all the code is correct at higher player counts. Thank you, testers!"},{"time":1690747808495,"text":"The names of commenters who are not also participants in the game now display correctly. This involved some mild refactoring. My tests show everything working, but do let us know if something wonky happens with challenges in particular. Thanks!"},{"time":1690814935899,"text":"I'm very happy to announce the availability of @Drew Edwards (Coldsalmon)'s game Agere on the production server, including the \"Cobweb\" variant played on a radial board (our first such game, but hopefully not the last). Let us know if you run into any issues. Enjoy!"},{"time":1690830637797,"text":"After a minor rule change, @Mark Khan's Clearcut is back on the production server. See the updated rule sheet for details. Let me know if you run into any trouble."},{"time":1690832173345,"text":"Will appear above the game board, next to the game's name, if and only if the game is unrated. Rated is assumed. May take a couple minutes to appear."},{"time":1690838593016,"text":"Push notifications are now \"double opt-in.\" If you wish to continue to receive push notifications, please click the gear icon in the top-right of the screen and click \"Allow push notifications.\" Once you do that, your browser/device takes over, so you may receive another request for permission. Notifications will then continue as previously announced (https://discord.com/channels/526483743180062720/1111447982345298121/1132411258805702766). Disabling push notifications from the user settings screen will immediately deactivate our ability to send you notifications until you reenable them.\n\nPush notifications are 100% optional. It's just another way to be notified of changes in your games. Please let us know if you encounter any issues or if you have suggestions for how we can do these even better. Thanks for playing with us!"},{"time":1690856678266,"text":"As a last code push of the day, I'm putting out two \"tutorials\" for trial. The first time you visit your dashboard or the game play page after the push propagates, you will see a blue \"beacon\" (see screen capture). Clicking it will trigger a brief tutorial walking you through the different components of the page. You will only see it once per device unless you go into the user settings screen and uncheck the \"Hide Tutorials\" checkbox. I welcome feedback on how helpful you find the content and what improvements you think are needed. I want to make it easy for new players to \"get up to speed.\" The only hiccup I see so far is that on mobile, the last screen of each tutorial won't show (the one that talks about the user settings dialog) because the log in button is hidden on mobile by default. I will have to see if there's a way around this. \n\nThank you for participating in this beta period! We launched because we wanted feedback from actual players about the features they wanted to see, and you have done that in spades. Thank you for your great ideas and your patience as they get implemented."},{"time":1690940662752,"text":"All the remaining list tables (standing challenges, ratings, current/completed games) have been moved to the new format. I've done some testing and fixed any obvious issues, but do let me know if something isn't working as you expect. One thing: in the current/completed games lists, there will be some missing data in some cases (e.g., winners, variants). Those will populate correctly from here on out, but I haven't gone back and retroactively fixed things yet. I will, but there are other DB changes being considered that would render that work moot, so leaving it be for now. Thanks! (I am seeing some layout weirdness. Further tweaks are forthcoming, but at least now the main migration is done.)"},{"time":1691597645074,"text":"I've added a \"News\" page to the main site for those that just aren't interested in joining the Discord. This server remains the authoritative and most up-to-date source of information about the site. The list on the site is manually maintained, so will only contain more major announcements and may sometimes be behind."},{"time":1691601101671,"text":"I made a pretty fundamental change to how the backend applies moves and determines who the next player is. My tests show everything working as expected, but stuff happens. Please let me know if something does not work as you expect."},{"time":1692361090427,"text":"@Game Designer Between Baldur's Gate 3 sessions, I chipped away at a game designer playground that can be found at http://designer.abstractplay.com. It's rudimentary, but I'd be interested in your feedback. I need to add tiling at some point, but all the basic features are there. The restriction, of course, is that it's tied to the pieces and boards available in our rendering engine. I am open to feature requests. Enjoy."},{"time":1692410532345,"text":"@Game Designer, in particular @Drew Edwards (Coldsalmon): I have added peer-to-peer networking to the designer. If you don't need it, you can just collapse and ignore the networking stuff at the very top. I may find a way to hide it more fully if people find it truly irksome. For those that have said they will use it ( 👀 @Drew Edwards (Coldsalmon) ), it's relatively straightforward. Simply share your connection ID with friends. They enter that ID in their own browser and it will connect the two of you directly. You can then manually pass around a \"talking stick.\" Whoever has the talking stick is in control, and their game state is forcibly sent to everyone else. It's not particularly robust, but it seems to fundamentally work. I welcome suggestions and bug reports. If you have any questions, let me know."},{"time":1692410581677,"text":"Basically it works like the Zendo client I wrote, available on GitHub and on my personal website: https://www.perlkonig.com/zendo/."},{"time":1692410659665,"text":"I should clarify that there is no server involved here. This is truly peer-to-peer. You both connect to a central server to negotiate basic connection information, but after that, all communication is between the connected peers directly. There's no server running in the background."},{"time":1692410939921,"text":"And it's assumed that you'll actually be communicating with the other involved humans through some other means, like Discord or the like. There's no chat feature or anything like that. It just gets too involved."},{"time":1692569336594,"text":"Mirador is now available on the dev server!"},{"time":1692731981751,"text":"I finally dug deeper into the configuration of our user account provider. Confirmation and password reset emails will now come from the correct domain, and email confirmation is now done by link instead of code. So regardless of how long it takes for you to receive or act on the email, everything will work as expected. You are not able to log in until the email address is verified. Please let me know if you or someone you know is having problems accessing the site. We want the onboarding experience to be as smooth as possible."},{"time":1692967207344,"text":"Mirador and Phutball now live!"},{"time":1694295372125,"text":"Razzle Dazzle (also known as Knight Moves) and Dag en Nacht now live on the development server! Please report problems if you find them!"},{"time":1694893778564,"text":"Razzle Dazzle (also known as Knight Moves) and Dag en Nacht now live on the production server!"},{"time":1694893823555,"text":"Also, move submit confirmations. These can be turned off (to get back to the current behaviour) in your user settings."},{"time":1695061479480,"text":"It's with mixed emotions that I announce that the original Super Duper Games will be shutting down permanently as of Thursday, November 30th, 2023. I will be downloading all the game records starting Monday the 27th of November. I will maintain the domain name, and a permanent landing page will be set up that will list all the games and point people to the SDG archive, already available on my Google Drive (https://drive.google.com/drive/folders/0Bw8J0V9P_9hMeEJUSXE1LXRBN00?resourcekey=0-cklbEpjB9v8pAJ8C2nHRww&usp=sharing).\n\nIf your favourite game was not migrated, please submit a suggestion. Thank you to all the players who have been a part of the SDG community for these many years."},{"time":1695302192389,"text":"@Samraku is organizing an Adere tournament! See the following thread for details: https://discord.com/channels/526483743180062720/1154353344450670592"},{"time":1695485006825,"text":"The game Armadas is now on its way to the production server. There is still an issue with manually typing moves, but the game otherwise functions fine, and I want to get it out of testing. I will continue to \"chew on\" this manual input issue. Enjoy!"},{"time":1695504780196,"text":"I'm pleased to announce that @Mark Khan 's game Hexagonal Y is now available on the production server. Please let us know if you encounter any issues. Enjoy!"},{"time":1695644542148,"text":"@bael 's game Bide is now available on the production server, supporting 2–6 players. Enjoy!"},{"time":1696264791976,"text":"There have been a few incidents where games are not being properly concluded in the database. We are looking for the root cause. In the meantime, if you get the error `Unable to get user data for [long string of numbers and letters]`, please don't try to do anything with your account, like reset passwords or stuff like that. Simply file a bug report in the #bug-reports channel. It's a relatively minor fix. Hopefully we'll figure this out soon. Thanks for your patience."},{"time":1696547509671,"text":"A notes feature has now been added (@Avri , @bael , @Samraku). Notes are private. Only you can see them. Notes are tied to games, not to individual moves. Notes disappear when a game concludes and is first cleared from your completed list. Because I had to pick a number, I've limited notes to 250 characters. That seems reasonable, but do let me know if it's too restrictive. Feedback on the UX is welcome."},{"time":1696547692131,"text":"I also now hide the \"rotate\" button below the board if the game is not flagged as needing rotation. For example, games like Cannon and Ordo are flagged as `perspective`, and the board is autoflipped for the second player. But games like Cephalopod and Streetcar Suburb are not, and so now the rotate button won't appear for those games. In an ideal world the rotation would work 100% of the time for all games, but for games with below-the-board areas, it doesn't work correctly. This seemed like a good middle ground for now."},{"time":1697061233244,"text":"My apologies to all note takers! I was not rigorous enough in my testing. The notes feature is now fixed, but it doesn't see existing notes. There was really no way around this. Notes are purged once a game ends. Let me know if there are further issues!"},{"time":1698206419403,"text":"Phil Leduc's game Murus Gallicus is now available on the production server. I'm pretty confident I've captured all the rules correctly, but it has been a long day 🙂 If you encounter any issues, please let me know right away and I'll try to salvage the game.\n\nIn discussion with Phil, with the goal of ensuring the \"best\" version of the game is the default, here's how things are configured:\n- The default ruleset is \"Advanced Murus Gallicus\" (with catapults).\n- By default, your first move is to redistribute one of your starting towers as walls on your second row.\n- The standard pie rule is also available.\n- There are three variants you can mix and match:\n  - \"Basic\" reverts the game to the \"no catapult\" state.\n  - \"Static\" disables the initial tower redistribution.\n  - \"Escape\" eliminates the breakthrough win condition.\n\nI should probably put that in the implementation notes, now that I think about it. Again, let me know if there are any issues. Enjoy!"},{"time":1698604099710,"text":"@Mark Khan's game Bounce is now available on the production server. Let me know if there are any issues. Enjoy!"},{"time":1699326585098,"text":"Records and analysis of completed games have now been made available. These records and statistics are not real time! They are generated every Sunday (6am UTC). \n- You can access all the records at https://records.abstractplay.com.\n- The new Statistics tab presents some analysis of the records.\n- Buttons for downloading all records, your records, and the records for specific games are visible on the Statistics page, your dashboard, and the completed games lists, respectively.\n\nI'll be doing some aesthetic tweaking later this week. We warmly welcome feedback and suggestions. Enjoy!"},{"time":1699550211737,"text":"Larger versions of the standard triangular Adere board are now available (@Drew Edwards (Coldsalmon), @Samraku). Enjoy!"},{"time":1699572635831,"text":"The clock and rated settings in the new challenge screen are now saved to your browser's \"local storage.\" That means the persistence is per device. For those that prefer different clock settings, hopefully this is a welcome change. Let me know if there are any issues."},{"time":1699815276569,"text":"Time controls are now explicitly visible on the game screen instead of only visible via tooltip. Also, the new challenge screen now has speed presets. The custom option is of course still available. This means a change to the default game clock. The default is now \"medium\" speed which is 2d/1d/4d (or roughly making a move at least twice a week). These settings are still persisted per device. Let us know if you run into any issues."},{"time":1699823165293,"text":"You can now explore variations in completed games and even annotate them. Here is an example\n    https://play.abstractplay.com/move/manalath/1/8703d405-c79d-4dd0-8e6c-ee54729a38b5?move=7&nodeid=d4b30785-eccb-4049-be84-cc9a97ebaba9\nNote that you can share the URL of a node somewhere in the tree. Make sure you turn on exploration. Move trees with comments are marked by a small comment icon. Just follow the icons untill you get to the comment.\nIf you were playing in a completed game, there should be a \"Publish exploration\" button. This can be used to publish the exploration you did during the game so that anyone can see it. Note that all completed game exploration and comments are visible to anyone.\n\nWhen there is a lot of exploration it might be a little slow in loading..."},{"time":1699927425693,"text":"Added some new stats and graphs to the Statistics page (it may take a few minutes to propagate):\n- On the Play Statistics table, a minimalist histogram of the number of completed games over the past 10 weeks is visible. If you click on the mini-graph, a full-size graph will appear with all of the data for that game.\n- A new \"Site statistics\" tab is available that gives you a histogram of all completed games on the site in seven-day \"buckets,\" and a new \"hours per move\" box plot will show you the spread of game speeds based on an average per game.\n- Finally, on the Games list table, there is now a \"recent\" column that gives the number of games completed in the past four weeks. This will give you a sense of what games are being played recently.\n\nLet me know if you see any issues or if you have feedback for other useful statistics you'd like to see. Enjoy!"},{"time":1700095639982,"text":"Added a couple more stats, because I'm a data nerd:\n- **Player statistics**: Added per-player graphs for the number of games completed in each seven-day period.\n- **Site statistics**: Added a cumulative \"first-time game completions\" graph that essentially shows user growth."},{"time":1700365728214,"text":"The solo playground is now available through the new Playground nav option. It leverages the built-in exploration function, so it only supports non-simultaneous games and only 2-player versions of games. You can also export any move state of any current or completed game to the playground. You only have one playground, and starting or importing a new game will replace the existing one. This feature is experimental. I've done basic testing, but it's possible there are edge cases that blow things up. Do let me know. Enjoy!"},{"time":1701008312546,"text":"I've added *h*-index to player stats. This index gives the number of games you've played at least that many times. So an *h*-index of 4 would mean you've played at least 4 different games at least 4 times each. If you've played all the games only one time each, then your *h*-index would still only be 1. The maximum *h*-index is the total number of games available on the site (56 right now, I believe)."},{"time":1701049427664,"text":"I'm pleased to announce the availability of @ManaT 's game Quagmire on the production server. @ManaT also coded this one for us—a first! Many thanks. Enjoy!"},{"time":1701129854426,"text":"After 18 years, the original Super Duper Games is now offline. There is a landing page up now that lists the games that used to be available (DNS propagation may take time depending on your area). I've maintained the local rules mirror as well. There's a link there to Abstract Play and a link to a publicly shared Google Drive folder that contains all the historical SDG data, including updated PGN game reports. Let me know if you encounter any issues with the site. If your favourite game didn't make it over, feel free to `/suggest` it. \n\nThe intent is for the landing page to be available \"indefinitely.\" The domain is paid up through 2025, so at least that long 🙂 \n\nMy sincerest thanks to all SDGers. I hope you will find a similar home here at Abstract Play. \n❤️"},{"time":1701741014666,"text":"**Testers wanted for new game Bao!** Bao is a sowing game from East Africa that I often hear called things like \"the king of Mancala games.\" It almost broke my brain, but thanks to the very patient @Deleted User , it's ready now for public testing. If you are willing to spend some time helping me iron out any final kinks, then please join us on the development server and challenge away. I'm of course interested in issues with the game itself, but I'm also interested in feedback on the board representation, which is new. Thank you to all testers! (See the pinned messages in this channel for instructions on how to join us on the dev server.)"},{"time":1702071405952,"text":"@pasxalis1987 's game AlmaTafl is now available on the production server. Let me know if you run into any issues. Enjoy!"},{"time":1702753052776,"text":"A few things have just rolled out:\n- **Last seen indicators:** When issuing a new challenge, you can restrict the list to those active in the past 7 or 30 days. On all lists where you can accept standing challenges, an indicator appears next to the challenger's name. Green means they've logged in in the past 7 days. Yellow means last 30 days. \n- **Player profiles:** *These are still very rudimentary at this point!* But you can now see a page of information on other players. Links appear in most lists, including chat logs. The page itself consists of multiple \"cards,\" the order of which you can change. I appreciate and encourage continued discussion of what you want to see here, and I will continue to adjust as I can. \n- **Country selection:** In the user settings screen (the cog in the top-right corner next to your username) you can now select the country you are playing from from a drop-down list. This is the only way we normalize the data entry. If your flag does not appear correctly on your profile page, please go into the settings and set it there. This is optional. You can set it to \"Prefer not to say,\" if you like.\n\nContinued feedback and suggestions welcome. Enjoy!"},{"time":1703094687833,"text":"The games Scaffold and Advanced Slither are now available on the production server. A huge thank you to @ypaul for coding these two games for us! Enjoy!"},{"time":1703258114229,"text":"Experiment time! Players may now add tags to the game table on the Games page. Your tags are publicly visible, so not everybody needs to create all the tags. Duplicates are ignored. The single search field also searches tags. Let me know if you run into any issues."},{"time":1703429580015,"text":"@Mark Khan 's game Byte is now available on the production server. Enjoy!"},{"time":1703456045940,"text":"Michael Amundsen and @bael 's game Lielow is now available on the production server. Again, many thanks to @ypaul for coding this one for us. Enjoy!"},{"time":1703458798632,"text":"And to round out the Christmas hat trick, the East African game Bao is now available on the production server. A huge thank you to the patient and persistent efforts of our testers, in particular @Samraku  and @Deleted User. This is one of the more complicated games on the server (top-three, methinks), so there are bound to be hiccups. Let me know if you run into any issues. But thanks to our testers and their excellent suggestions, I think the game is in a good place. Enjoy!"},{"time":1703461296354,"text":"Oh, and a note about Bao and all future sowing games: if you click the cog icon under the game board, you can switch to a pip view instead of a numeric view:"},{"time":1703530473588,"text":"The central Asian mancala-style game Toguz Kumalak is now available on the production server. Enjoy!"},{"time":1703604006076,"text":"And @ypaul is keeping the holiday cornucopia flowing with the addition of @bael 's game Trike. It's now available on the production server. Enjoy!"},{"time":1703735722765,"text":"Thanks to the prolific @ypaul , the impossibly named game Iqishiqi is now available on the production server. I know it has been a fire hose lately, but I hope these new games will keep you busy over the last of the holidays. I'm sure things will slow down once the day jobs start banging at our doors again. Enjoy!"},{"time":1703784135165,"text":"TLDR: You can now customize the player colours. Go to the main settings screen (the cog next to your username) and click the button Manage Palettes. Create as many palettes as you want. Then go to a particular game you want to customize and click the cog icon below the game board. Apply the desired palette.\n\nAnd now some context:\n- Most colours in most games are assigned by number. A palette simply provides custom colours for each of the player numbers.\n- This will also affect properly assigned markers and annotations.\n- Custom colours only affect *your* experience. Nobody else is affected.\n- This will not work for all games! Some (like Wizard's Garden) are hard coded. And others (like Streetcar Suburb) use arbitrary colours from the palette and are not in typical player order. Some experimentation may be required. If you encounter trouble or have questions, do reach out.\n- Creating a palette with the same name as an existing one will overwrite it.\n- If you delete a palette that is assigned to a game, the game will revert to the standard palette.\n- Finally, I am *certain* there is some edge case I am missing that will blow a game up. If something goes horribly wrong, just let us know.\n\nEnjoy!"},{"time":1703894517984,"text":"Completing a mancala trifecta, @Mark Khan 's game Diffusion is now available on the production server. Enjoy!"},{"time":1703904468463,"text":"Stephen Tavener's game Furl is now available on the production server, thanks again to @ypaul. Enjoy!"},{"time":1704148642563,"text":"Some experimental customization features were just pushed to production:\n- There is now a global dark mode available. Simply click the button next to your username. Your selection is saved per device. I am open to feedback on how to improve it, but know that there is no \"one right way\" when it comes to front ends. But I will do my best to maximize its value.\n- You can now customize the appearance of your game boards using CSS. This is an advanced feature and is not without risk. Never inject code you either do not understand yourself or has not been vetted by someone you trust. I'm creating a new Discord channel specifically for discussions around customization. Join us there for more information (#customization).\n\nI've also added links in the footer to the official BGG list of games available here and to a new wiki. Enjoy!"},{"time":1704148711435,"text":"And @ypaul continues his streak of awesomeness to bring to us all the game Havannah! Compete to surround at least one cell, connect two corners, or bridge three sides. Enjoy!"},{"time":1704300198413,"text":"The oldie but goodie Hex is now available on the production server. Thanks again to @ypaul for coding this one for us. Enjoy!"},{"time":1704303334430,"text":"UI change on the way to the production server. The playground now has a \"Random Move\" button if you just want to play with the rules (obviously only works for games that generate move lists). A \"Pass\" button now appears next to the move selection drop down (a) if that game generates a move list and (b) \"pass\" appears in that move list. You still need to click \"Submit\" after clicking \"Pass.\" Let me know if there are any issues."},{"time":1704304978069,"text":"And thanks again to @ypaul, the popular \"new\" abstract Tumbleweed is now available on the production server. Make time for games, people! There's a lot of 'em! 🙂"},{"time":1704315699943,"text":"To prevent hard errors when creating a palette with an insufficient number of colours, small palettes are automatically topped up with white. So if you find yourself in a game with a bunch of white pieces, it's because the palette you assigned to that game didn't have enough colours. Let me know if you run into any further issues."},{"time":1704479306666,"text":"Kanare Kato's game Meridians is now available, thanks to the efforts of @ypaul. Thank you, and enjoy!"},{"time":1704662086424,"text":"@Drew Edwards (Coldsalmon) 's mining game Mattock is now available, thanks to @ypaul. Enjoy!"},{"time":1704742744713,"text":"Vincent Everaert's draughts-style area control game Exxit is now available. Thanks to @eykca for the suggestion and for testing. Enjoy!"},{"time":1704930553586,"text":"Just a heads up that I'm cleaning up some URLs, so the login URL will soon be an `abstractplay.com` URL. The issue is that, if you use your browser's password autofill, it won't automatically fill the first time you log in after the change. I apologize for the inconvenience, but this change means it will (hopefully) never change again in the future. I've already added the logo and will be making some other minor aesthetic tweaks to the login screen so it's more in line with the rest of the design."},{"time":1705281894332,"text":"I'm pleased to announce our first steps towards integrating Ai Ai with the site. Many thanks to @Mrraow for making adjustments to Ai Ai to support our goals. To start, there is only one supported game, but others will follow:\n- The only game currently supported is Furl. To play against the AI, issue a new challenge to the player `(Bot) Ai Ai`.\n- The \"time to think\" is hard coded to 10 seconds. Depending on various factors, it can take anywhere from 15 seconds to a couple minutes for a move to execute. But if it doesn't execute in that time, do let us know.\n- Just because Ai Ai can play a certain game doesn't mean we can integrate it. Games with random starts (like Tintas), for example, won't work.\n- I'll post here as new games get added. Enjoy!"},{"time":1705464570121,"text":"Tournaments are now live! Please check it out and propose a tournament if you want one. There is a description of how tournaments work at the tournament page: https://play.abstractplay.com/tournaments. Enjoy!"},{"time":1705596900231,"text":"The AiAi bot can now play the following games. Let me know if you run into any issues:\n- Dag en Nacht\n- Fanorona\n- Lielow\n- Trike\n- Zola\n\nApparently the bot plays these games quite well, so the thinking time has been truncated to 1 second for these games."},{"time":1705597443258,"text":"An error in the Trike code was corrected. Games currently in progress will not be interrupted, but the board coordinates will still display incorrectly. Games starting from now will be correct."},{"time":1705607281227,"text":"Two Nick Bentley games, Catchup and Blooms, are now available. Thank you, @ypaul, for coding those for us! Enjoy!"},{"time":1705791312147,"text":"@eykca's game Mimic is now available. Thank you, @ManaT, for coding it for us! Enjoy!"},{"time":1705936119748,"text":"@Gatsby's game Veletas and the uncredited game Gess are now available, thanks to @ypaul. The firehose continues!"},{"time":1705953058708,"text":"The AiAi bot can now play Tumbleweed and Amazons. Let me know if you run into any issues."},{"time":1705961554487,"text":"The \"completed games\" table on your dashboard is now only pruned after a week instead of 48 hours (@Martin Grider). This should minimize any gaps between stat runs. This is not retroactive. It only affects games added to your \"completed games\" starting now."},{"time":1706058509193,"text":"I am rolling out a \"Disable Exploration\" mode for new challenges. If a challenge does have this option enabled, it will appear prominently when you view the challenge and at the top of the play page (see secreenshots). Perhaps it is my personal bias, but I encourage people to use this sparingly. It's the one feature that imposes restrictions on other players. It is still being determined whether this will be applied to tournament games by default. Let me know if you run into any issues."},{"time":1706201450546,"text":"A couple minor tweaks to existing games. Let me know if something doesn't work as you expect:\n- **Gess**: The centres of pieces can now be moved into the gutter (not common, but is allowed) and some annotations have been tweaked to hopefully clarify things.\n- **Martian Chess**: To prevent deadlocks, if seven consecutive turns have happened without a capture, then someone can \"call the clock.\" Once triggered, if seven further turns pass without a capture, then the game will be terminated and scored. Also, the game now ends immediately once someone reaches 18 points."},{"time":1706636897158,"text":"@emptytheory's game Verge is now available. Thank you, @ManaT, for coding it for us. This is our 80th game. Enjoy!"},{"time":1706821982577,"text":"A few announcements today:\n- **New Variant**: A random start variant has been added to Veletas.\n- **New Game**: Nestor's game Onager is now available. Similar in some ways to Epaminondas with the stumbling blocks variant, in Onager you walk and leap across the board, trying to reach your opponent's home row. (Thank you, @ypaul, for coding this for us!)\n- **New Game**: James Ernest's game Tablero di Berona is now available. This is the first AP game to include dice. I thought it was strategic enough to include, and there's at least one other dice game I'm considering. I think a little randomness can be a good thing sometimes 🙂 I will admit that the way the dice work may take a few turns to get used to, but do read the implementation notes, and let me know if you have suggestions for how to improve things.\n\nThanks, as always, for participating in our little community. Let me know if you run into any issues. Enjoy!"},{"time":1706834928375,"text":"@Zomulgustar's simultaneous tile selection game, FNAP is now available. Let me know if you run into any issues. Enjoy!"},{"time":1706914870028,"text":"Three minor UI changes:\n- Tablero di Berona has been fixed to work in dark mode.\n- In the Manage Palettes dialog, you can now see the hex values of your chosen colours.\n- A highlighted text notice now appears when your move still needs to be submitted. The Submit button has also been made larger. Hopefully this will alleviate some of the issues. Further discussion welcome."},{"time":1706927043073,"text":"I've updated Entropy as follows:\n- Annotations have been expanded to always show the previous two turns (so both placement and movement).\n- The piece you just placed or clicked on for movement is now highlighted with a dot. (Background highlighting might have been preferred, but it's not really possible given the vagaries of the Entropy renderer.)\n\nTo accomplish this, I had to meddle far more with the code than I would have liked. I always get very nervous when fiddling with battle-tested code. I played a test game, and everything appeared to function as I expected, but I screw things up all the time 🙂 Do let me know right away in the #bug-reports channel if you run into any issues with a game."},{"time":1706983753130,"text":"@Mark Khan's game Clusterfuss is now available. Enjoy!"},{"time":1706992673022,"text":"The game ConHex is now available, thanks to @ypaul. This includes the default 11x11 size and a larger 15x15. Enjoy!"},{"time":1707090483827,"text":"The James Ernest + Mike Selinker game Fightopia is now available. This is the first \"multicell\" game on AP. Maybe it will inspire one of our many game designers! Do let me know if you run into any issues. Enjoy!"},{"time":1707246881868,"text":"Just want to clarify for Alfred's Wyke players that the button bar highlighting has changed *in dark mode only*. In dark mode, the most recently used move is the lighter colour, and the oldest one is the darker. This is the inverse of how it is in light mode. Do let me know if you run into any issues."},{"time":1707249439019,"text":"You can now filter the tournaments page by registration status (will take a few minutes to propagate)."},{"time":1707861056107,"text":"A new mobile-specific play page has just been pushed to production. The changes only affect small screens (<770 pixels wide):\n- The undo button has been forced to the far right to give maximum space from the submit button.\n- The page layout has been broken up into \"cards\" that can be moved around (well, up and down). The play page consists of five sections, which you can now order as you see fit on a per-device basis.\n- This does not affect the single-player playground page.\n\nThe user names above the move tree also now link to the player profiles (@abdekker). Let me know if you encounter any issues!"},{"time":1707861568328,"text":"Also, exploration has been focibly disabled for dice games (Tablero di Berona and the forthcoming Take-Back-Toe). It never mattered because you can't cheat. The dice rolls are not finalized until after you click Submit. But it could still cause confusion and posed issues to the exploration code. This seemed like a reasonable solution."},{"time":1707876480711,"text":"Three more James Ernest games are now available:\n- Hens and Chicks is a draughts-style game with two types of pieces and a unique capturing mechanic. Pieces can only move forward, and you try to reach your opponent's home row.\n- Queensland is a game where you try to form long, unobstructed corridors between your own pieces. Because of the second-player advantage, you play two games sequentially, switching seats. Highest combined score wins. This is the first time we've done this mechanic.\n- Take-Back-Toe is a simple dice game where you try to form stacks of the same height on your home row.\n\nLet me know if you run into any issues. Enjoy!!"},{"time":1708269315793,"text":"@Mrraow's polyomino, colour theory game Four is now available. Let me know if you encounter any issues with the new polyomino manipulation feature. Enjoy!"},{"time":1708280279221,"text":"Mitsuo Yamamoto's game King's Valley is now live, including the \"labyrinth\" variant (@tommynomad). Try to land your king on the centre space, but your pieces always have to move as far as they can. Teamwork! Enjoy!"},{"time":1708394487515,"text":"Christian Freeling's draughts game Dameo is now available. Enjoy!"},{"time":1708789118109,"text":"Three new games are now available:\n- Christian Freeling's game Symple is a territory control game where you have to balance growing your existing groups and creating new ones.\n- The classic pegboard game Twixt is now available, thanks to @ypaul. This one may prove a little challenging on mobile. You'll definitely need to zoom in when it comes time to rearrange your connections.\n- And finally, a whopping 10-pack of Hnefatafl games have been packaged under a single entry, thanks to the heroic efforts of @ypaul. See the wiki for details (https://abstractplay.com/wiki/doku.php?id=hnefatafl).\n\nEnjoy!!"},{"time":1708879486522,"text":"It has been brought to my attention that my implementation of Bao was not entirely accurate (https://boardgamearena.com/bug?id=60693). A challenge with these complex traditional games is that it can be difficult to find comprehensive rules descriptions. According to the rules, a nyumba is \"nonfunctional\" if it has fewer than six stones, but my implementation allowed the placement of a sixth stone at the beginning of the kunamua phase to reactivate the nyumba. This is apparently not correct for kutakata turns. So in the screen capture below, blue cannot place a stone, reactivate the nyumba, and then tax it. Instead, they would have to sow the nyumba, thereby losing it. I know this situation has come up a few times in games I've played. I apologize for the error."},{"time":1708879687584,"text":"@Mark Khan's game Take and @ManaT's game Root Bound are both now available, thanks to @ManaT. Enjoy!"},{"time":1708891023661,"text":"The ol' classic Reversi is now available, in a number of different board configurations, thanks to @ypaul. Enjoy!"},{"time":1710092337237,"text":"Philip Slater's game Blockade is now available, thanks to @ypaul. Enjoy!"},{"time":1710524586363,"text":"Our 100th game, Markus Hagenauer's Cairo Corridor, is now available, thanks to @ypaul. This one is unique. Enjoy!"},{"time":1710687605117,"text":"Connection game lovers, rejoice! @Corey L. Clark's game Connecticut and @Gatsby's game Saltire are now both available, thanks to @ypaul. Enjoy!"},{"time":1710716487075,"text":"I've pushed some interim changes to the games list page:\n- For now, at least, user-generated tags are disabled. They may come back later, but for now, they've been replaced with fixed category tags.\n- There are a lot of tags, and maybe I'll trim them down later, but for now there are four major sets of tags, presented in the following order:\n  - **Goals:** These describe how the outcome of the game is determined (abbreviated in tag form as `G:`).\n  - **Mechanics:** These attempt to describe generally how the game is played (abbreviated in tag form as `M:`).\n  - **Board:** Describes the playing surface. Because so many games have a rectangular shape and connectivity, I may eventually remove these.\n  - **Components:** Describes the components needed to play (abbreviated in tag form as `C:`). Since the vast majority of games are \"simple,\" I may eventually remove these.\n- Clicking on a tag will find games that contain that tag. Clicking on multiple tags does a \"logical and\" function (so the displayed games contain *all* the selected tags).\n- You can hover over a tag for more details.\n- There are now separate search fields specifically for game name and designer.\n\nThere are many more changes I intend to make to this screen, specifically around mobile UX. Please join us in the #suggestions-archive channel if you have concrete suggestions for how we can improve the usability of this page on small screens. Feedback welcome!"},{"time":1712068327595,"text":"More joy for connection game afficionados! Thanks to @ypaul, the following connection games are now available. Enjoy!\n- Bill Taylor's game Quax\n- João Pedro Neto's game Nex\n- @Mark Khan's game Atoll"},{"time":1713556525894,"text":"@Mark Khan's game Clearcut has been transformed into Halfcut. The game records and ratings remain but will be flagged as Halfcut games with the \"Clearcut\" variant. To minimize the damage to the database, the unique identifier for this game has NOT changed. So while the display name is now \"Halfcut,\" the database key and URL have remained as `clearcut` (https://play.abstractplay.com/games/clearcut). It's not ideal, but it's far easier than the alternatives. Thanks to @ypaul for revamping the code. Let me know if something weird starts happening."},{"time":1713560891913,"text":"I have tweaked the Next Game button so that it sorts the games by time remaining, and clicking it before submitting your move moves the game to the end of the queue so it cycles more predictably than before. There is more to do here, but you gotta start somewhere 🙂 Let me know if anything weird happens."},{"time":1713639792093,"text":"The übermensch @ypaul has done it again, bringing us a whopping SIX new n-in-a-row games. Enjoy!\n- Four In A Row (your basic Connect4 with some wild gravity options)\n- Connect6\n- Gomoku\n- Irensei\n- Pente\n- Renju (this one gets a little crazy 😁 )\n\nLike with Tafl, these games involve a fair bit of jargon. See @ypaul's excellent wiki article for details: https://abstractplay.com/wiki/doku.php?id=n-in-a-row_games."},{"time":1713639803111,"text":"To implement the more intricate pie rules of these games, some changes were made to the front end so that player colours update appropriately. Do let us know if something weird happens."},{"time":1713723947881,"text":"New size variants are available for Crossway, Scaffold, and Connecticut."},{"time":1714244737390,"text":"Dark mode changes are now on their way to production. Let us know if something is not working as you expect, or if you have suggestions for improving the mode generally."},{"time":1714325782402,"text":"You are now able to customize the six \"context\" colours used in both light and dark modes for drawing boards. Click the cog in the top-right corner and click the \"Manage Colour Contexts\" button. These changes are global (apply to all games). You can customize boards for specific games by clicking the CSS icon below the game board. Visit the #customization channel for more information and targeted assistance. Further feedback always welcome."},{"time":1714336791079,"text":"**Streetcar Suburb:** The colours of buildings and taken housing limits were already being stored, but they just never made it into the chat strings. Chat logs and coloured annotations should now be visible for all past and future games. Let me know if something doesn't work as expected."},{"time":1714337419331,"text":"The new James Ernest game Prudh is now available. At James's recommendation, only the standard rules are implemented. Enjoy, and thank you, testers!"},{"time":1714339540819,"text":"The list of games now includes a sortable column showing the date the game was added. I know this table is wide. Only so many hours in a day!"},{"time":1714498030777,"text":"Yet again, @ypaul brings us more games! The following are now available. Enjoy!\n- Two Cameron Browne three-dimensional games: Akron (connection) and Margo (Go variant)\n- Martin Windischer's smaller-scale 3D connection game Sponnect\n- The @Mark Khan + @Gatsby collaboration Necklace"},{"time":1714668512342,"text":"Zooming and panning should now work as expected on game boards. That includes your standard pinch gestures and mouse wheels. Let me know if something does not work as expected or if you believe there is another modality that should be supported. I have removed the \"jerry-rigged\" zoom button/feature as a result."},{"time":1714782769217,"text":"Changes to the zoom feature have been pushed to production: \n- I have disabled the new zoom features on small screens because the standard pinch and zoom has always worked fine on mobile devices.\n- On desktop, I have made some minor adjustments to try to maximize the space available to the game board.\n- On desktop, there is now a toggle button below the game board that lets you switch the game page to the vertical/mobile layout. Vertical mode disables the new zoom feature, but it does force the game board to full screen width (this is a per-device setting).\n- For the record, Ctrl++ does not work and likely will never work as you might hope. To my knowledge, there is no way around this, but if anyone out there has CSS knowledge and is able to show me how make that magic work, I am all ears."},{"time":1714836846412,"text":"User chat has been expanded to allow for basic Markdown, including links but *excluding* images. To force line breaks, you need an empty line between the two paragraphs of text.  This should be retroactive. Let me know if you encounter any issues."},{"time":1714923918627,"text":"Thanks to @ypaul, Margalith Akavya's game Upper Hand is now available. Two variants have also been added to Connect6. Enjoy!"},{"time":1715621757677,"text":"Stephen Linhart's game Susan is now available, thanks to @ypaul. Enjoy!"},{"time":1715623650183,"text":"@Mark Khan's game Oust (hex and square) is now available, thanks to @ypaul. Enjoy!"},{"time":1715632843101,"text":"The traditional sowing game Oware is now available. It implements the more common tournament rules where \"grand slam\" moves are legal but don't result in any captures. Let me know if there are any issues. Enjoy!"},{"time":1716755336946,"text":"Thanks to @ypaul, the following games are now available. Enjoy!\n- @Gatsby's Ayu\n- Dieter Stein's Spook"},{"time":1717449887967,"text":"To keep zooming from interfering with scrolling, the zoom starts as disabled by default. Click the magnifying glass icon below the board to enable/disable zooming. Let me know if there are any issues."},{"time":1717888214694,"text":"Thanks to @ypaul  and @ManaT, we have a cornucopia of new games now available:\n- @Gatsby 's games Pletore and Stigmergy\n- @🪷GoldGeneral_0 's game Anache\n- And *four* Shibumi games:\n  - Dieter Stein's Spire\n  - Néstor's Spline\n  - Matt Green's Sploof\n  - @Avri's Spree\n\nEnjoy!"},{"time":1718312217709,"text":"@Gatsby's game Asli is now available. This is game #130. Enjoy!"},{"time":1718320336534,"text":"We've adjusted the Homeworlds renderer so that the periphery systems are now sorted into three columns, and the systems in each column are sorted strictly by recency. See the screen captures for an example. Please let me know if you run into any issues! Feel free to join us in the #suggestions channel if you have recommendations on how to further improve the Homeworlds experience. Enjoy!"},{"time":1718651536468,"text":"@Mark Khan's game Conect is now available, thanks to @ypaul. This includes a couple different board sizes, and an option to play the game on the flat rhombus if you prefer. Enjoy!"},{"time":1719436851953,"text":"Just a friendly reminder that it is possible to change your Discord name on a per-server basis. If you want to make it easier for others to find you here, consider changing your Discord name to your display name on the site. To do so, right-click or long-hold the server icon, then select Edit Server Profile. Thanks!"},{"time":1720367801507,"text":"I have finally merged some fundamental renderer changes into production, which will enable more liberal board rotation options. The front-end changes to enable this will come later (but soon). Please let me know if something weird starts happening. The site is being actively developed, so odd occurrences are inevitable, and I have appreciated your patience. Thank you."},{"time":1720374393061,"text":"90-degree rotation is rolling out now. Games flagged as having \"perspective\" will be automatically rotated for the second player, and you can use the buttons below the board to rotate further. Let me know if you encounter any issues."},{"time":1720977017564,"text":"Six new games are now available, mostly thanks to @ypaul. Let us know if you encounter any troubles. Enjoy!\n- @Gord!'s free-style connection game Calculus (Many thanks to @dalewalton's help testing and devising the pathfinding algorithm.)\n- Rich Gowell's  Entrapment\n- Kevin Kane's heXentafl\n- @Mike Zapawa's Slyde\n- Jorge Gomez Arrausi's Unlur\n- Dieter Stein's Volo (This is the 13th Dieter Stein game.)"},{"time":1721859226738,"text":"You will see that the main menu has changed a little again. Tournaments are now grouped under the general heading Events, and you'll see that there's now an \"Organized Events\" feature. This will let individuals organize one-off events of arbitrary structure and composition. I implemented this because the PerGioco folks reached out wanting to run tournaments here (https://www.pergioco.net/). They will be the first to use this new feature, and I hope we'll be able to work out any kinks and make UX improvements as we go. Expect to see further announcements here as events launch. Anybody else that's interested in creating events just needs to reach out to me. To keep things manageable as the feature is rolled out, people need to be authorized to create new events. \n\nAs you interact with this feature, I welcome feedback and suggestions on how to improve things. Thanks for your continued engagement."},{"time":1721920171404,"text":"We are running test tournaments for LoA, Pente, and GoMoku. All are welcome.\nhttps://play.abstractplay.com/events"},{"time":1722018313302,"text":"Event information has now been added to historical game records, and you can now download game records grouped by event (https://records.abstractplay.com/). Buttons to do so now appear on the completed tournament and event pages. I'll just note, though, that game records are still only generated weekly."},{"time":1722031429405,"text":"Two new buttons now appear in the Status section of all games. The refresh button does just that. Apparently when you \"install\" AP as an app on some devices, you can no longer trigger a page refresh. This fixes that, at least for game play pages. The clock icon will instead trigger periodic refreshes. Every 60 seconds for 30 minutes (or until you manually refresh or leave the page, or click the button again to turn them off), the page will fetch the most recent game state. This will hopefully make realtime games a little more bearable for folks. Please let me know if something does not work as you expect. Enjoy!"},{"time":1722194037994,"text":"New code is on the way that changes how the \"Next game\" button works. It now appears regardless of how you reached that page, and it will continue taking you to the next game as long as there are games needing your attention. When there are no more games, it returns you to the dashboard. Let me know if something does not work as you expect."},{"time":1722655354583,"text":"Some new games are now available. This brings us to 140 total. Enjoy!\n- Nick Bentley's Strands (thanks to @ypaul)\n- João Pedro Neto's Gonnect (thanks to @ypaul)\n- @pokshtya's Dragon Eyes (thanks to @ManaT)\n- And a misère variant of Dameo (thanks to @ypaul)"},{"time":1722717793028,"text":"Isometric rendering has come to AP! Its first application is to @Mark Khan's Zola, where the unequal spaces are most intuitively perceived in 3D. Click the gear icon below the board and select the isometric display option. Rotation is supported through the buttons below the board. This opens things up to more 3D-style games in the future. Let me know if something doesn't work as expected. Enjoy!"},{"time":1722893740578,"text":"An isometric view of @bael's game Bide is now available:"},{"time":1723054786275,"text":"A few small frontend tweaks:\n- A link to the wiki has been added to the game information dialog (the 'i' button below the game board).\n- The name of the game above the board now links you to the game's landing page.\n- The game landing pages have been cleaned up a bit, now with tabs and quick links to rated players and other info.\n\nAlways open to suggestions on how to improve these pages. Thanks for your continued input."},{"time":1723245368831,"text":"I've released a Homeworlds diagram generator to facilitate creating diagrams for illustration and discussion. Let me know if you run into any issues. Thanks!\n\nhttps://hwdiagrams.abstractplay.com/"},{"time":1723312986625,"text":"On a related note, there's a new button underneath Homeworlds games now that will copy the current position onto your clipboard for importing into the new diagram generator."},{"time":1724001846496,"text":"v1.4.0 of the AP Designer is now live, which supports annotating a given board position (movement, enter/exit, and dots). Let me know if something does not work as expected, or if you have further improvement suggestions: https://designer.abstractplay.com/."},{"time":1724710775439,"text":"@ypaul brings us a new bounty:\n- Crummack & Galley's game of spreading and converting, Ataxx\n- Nick Bentley's game Bug\n- Arrausi's sowing game Buku\n- George S. Parker's Chess/draughts-like Camelot\n- Bill Taylor's game Majorities\n- And two new Tumbleweed variants:\n  - \"Capture delay,\" where you may not place at where your opponent just placed, and\n  - \"Free neutral,\" where on the first turn you place a 2-stack neutral piece and a 1-stack piece of each player's colour.\n\nAnd finally, @Castux joins our group of @Code Contributors by coding his own territory-control game Tritium.\n\nThanks to you both! Enjoy!"},{"time":1725228661215,"text":"Thanks to @Castux, the game Lifeline is now available. Enjoy!"},{"time":1725578062284,"text":"More new games! Enjoy!\n\n@ypaul brings us three new connection games:\n- Christian Freeling's games Query and Lox\n- Nick Bentley's game Shifty\n\nAnd @ManaT brings us @dalewalton's first game here at AP, Natal Seas - Pods."},{"time":1726321845944,"text":"Three new games now available for your intellection. Enjoy!\n- Tom McNamara's game Connections (thanks, @ypaul)\n- Takuro Kawasaki's game Control (thanks, @ManaT)\n- Édouard Lucas's classic Dots and Boxes (thanks, @ypaul)"},{"time":1726322107968,"text":"New boards now available for Adere:\n- Drew's hand-crafted \"moon\" board (a standard hexhex5 with a subdivided central cell)\n- a \"limping 5-6\" hex field\n- 8x8 and 10x10 slanted hex boards\n\nAlso, at @Drew Edwards (Coldsalmon)'s request, the four-ring cobweb variant has been removed, leaving the tighter three-ring version. This doesn't change the historical record. You just can't create *new* four-ring versions (well, technically, you still can on the dev server if you really want to). Let me know if something does not work as expected."},{"time":1726428973357,"text":"You can now provide your BGG username and some Markdown-enabled \"about me\" text (255 characters max) by clicking the cog icon in the top-right corner of your screen. This information will be visible on your player profile page. Let me know if there are any issues."},{"time":1726931395288,"text":"Apologies if you received multiple \"Your Turn\" notification emails this morning. Occasionally, even though I'm in test mode, duplicates sometimes still get sent. On the bright side, an error was fixed that should ensure that a number of people who were not receiving the emails now should. A reminder that you can disable these emails by clicking on the cog icon in the top-right corner of the screen (or in the \"hamburger\" menu on mobile) and adjusting to your preference. Let me know if you encounter any issues."},{"time":1727020968931,"text":"@bael's game Resolve is now available (thanks, @ypaul). Also, a \"no incursions\" variant has been added to @Gatsby's Asli, and the \"Plus\" variant has been added to @pasxalis1987's AlmaTafl. Enjoy!"},{"time":1727557947398,"text":"The \"Moon Labyrinth\" variant has been added to King's Valley. This variant is described in the designer's new Kickstarter campaign (https://www.kickstarter.com/projects/logygames/kings-valley-labyrinth-new). Still a 7x7 board, still four towers, but the towers start in slightly different positions, and players can move them. Let me know if there are any errors. Enjoy!"},{"time":1727884767528,"text":"Stats generation is on hold, I'm afraid, for a bit. I've reached some hard limitations of what AWS Lambdas can do, so I need to find a dfferent way of approaching the problem."},{"time":1727983585376,"text":"I've worked around the major memory bottleneck for now, so the stats will be updated soon and will start generating weekly again. Other bottlenecks remain, but I'll keep looking for a more sustainable approach. Thanks for your patience."},{"time":1728228993513,"text":"To help more active players keep on top of tournament games, the \"Your move\" table now highlights which games have \"hard time\" clocks with an exclamation point. I'm open to suggestions for how to improve the display. As a reminder, the default state of AP games is \"soft time,\" meaning that your opponent has to manually claim the win on time. Tournament games and some manual challenges are flagged as \"hard time,\" meaning the game will immediately terminate when the clock runs out."},{"time":1728238164025,"text":"A few changes:\n- Dan Troyka's switch-based connection game Alta is now available (thanks, @ypaul).\n- Larry Back's snubsquare+ connection game Onyx is now available (thanks again, @ypaul).\n- A new \"compressed\" variant has been added to Tablero di Berona that compresses the ratio of the highest-value space to the lowest from 6:1 to 2:1, encouraging more active competition for the lower spaces (thanks, @Samraku, for the suggestion).\n- And finally, the dice in Tablero and Take-Back-Toe will not display until the move is committed, just to avoid any potential confusion.\n\nEnjoy!"},{"time":1728421540883,"text":"I've tweaked the hard-time indicator to be a little less \"in your face.\" Also, it can now be changed using CSS. See the customization channel for details: https://discord.com/channels/526483743180062720/1191510010363138108/1293317897636024372."},{"time":1729367216719,"text":"Thanks to @Castux , @hoembla's game Hula is now available. Be the first to create a closed loop around the centre cell. Enjoy!"},{"time":1729373320202,"text":"I've made some changes so that \"new chat\" indicators appear in the active game tables on the dashboard. When entering a game that has new chat, an indicator will appear on the top-right of the board section. That will persist until you leave the page. (Once you view the game page, the \"last seen\" updates, so the chat will not appear as \"new\" again.) This required some minor changes on the backend, which always scares me a little 😄 Let me know if something unexpected happens. Thanks for your patience."},{"time":1729632014210,"text":"Related to those \"minor changes on the backend,\" I've fixed a bug that was causing pretty consistent \"failed to fetch\" errors when loading games while not logged in. Thanks for your patience."},{"time":1730488820975,"text":"Thanks to @ManaT, the traditional Hawaiian game Konane is now available. Enjoy!"},{"time":1732731710672,"text":"@Mark Khan 's game Blast Radius is now available. Enjoy!"},{"time":1732826925662,"text":"Marcos Donnantuoni's simultaneous game Frames is now available. This is an old SDG game where you try to \"get into your opponent's head\" to enclose more of your own pieces. Enjoy! ( @personman )"},{"time":1734124449751,"text":"Three new pyramid games have been added. Let me know if you run into any issues. Enjoy!\n- In Erik Dresner's game Logger, players grow and harvest trees for points. Supports 2-4 players. Moves are more complex than most abstracts, but there's lots of highlighting and error messages to help.\n- In Carlton Noles's game Subdivision, place various types of buildings in the city to maximize your score. This is an old SDG game. There are a couple setup options for diversity. Supports 2-4 players.\n- Doug Orleans's game Pylon has two phases: first you fill the board with pyramids (a random \"quick start\" option is available), and then you build stacks. Control the most pyramids to win."},{"time":1734213524165,"text":"I've just enabled some new code to let us handle games with hidden information. It's a backwards-compatible change, and my tests are showing things working as expected, but do let me know if you notice anything unexpected."},{"time":1734286910409,"text":"The Decktet game Jacynth is now available (supports 2 or 3 players). This is our first card game and our first game that includes hidden information (but not the last). Enjoy!\n\nA few notes on hidden information:\n- Particpants will only be able to see their own hands, and observers will see none of them. The \"cards in deck\" display will adjust to only account for visible cards.\n- Once a game is over, all hidden information becomes public. You'll be able to review the game from the beginning seeing all hands.\n- *Starting* a game in the playground will let you see all hands and play as usual.\n- *Exporting* an active game to the playground will *not* work as you expect. It will export, but you still won't see the other hands. Exporting a completed game will work fine."},{"time":1735163166392,"text":"Information on timeouts, both site wide (Site Statistics page) and individually (on player profile pages), is now visible. Extensive validation is challenging. The data seems right for me, so I'm assuming it's right for everybody, but please let me know in #bug-reports if something appears to be off.  Merry Christmas! (@slimy_asparagus: Nicholas Bamber  @Samraku )"},{"time":1735326892880,"text":"I've added response time data to the player profile pages. There are some display challenges with this page that I need to figure out. I will work on those when I have a little more time. Thanks for your patience. Hopefully this data will be useful. (Again, validation is challenging. Let me know if your data appears to be off.)"},{"time":1735489502066,"text":"@Drew Edwards (Coldsalmon)'s game Moon Squad is now available. It includes the default circular board and two different hexhex variants. Happy new year!"},{"time":1735509826062,"text":"The old SDG version of Robo Battle Pigs is now live. Because the internals were different enough, this is the first (and hopefully last, or at least very rare) instance where a variant is treated as a separate game. This new variant is called `Robo Battle Pigs (Continuous)`. It supports 2-8 players and is the first game to allow things to proceed after someone resigns or times out.\n\nIn this version, you only issue a single command per turn (after the first), and only one order resolves for each player each turn. The game is therefore longer but more deliberate and strategic. This game has hidden information. You can see what your opponents just did, but you can't see their stored order queue until the game ends, at which point all hidden information will be visible and explorable.\n\nI've done what testing I can locally, but simultaneous games with this many players is challenging. Please let me know if something does not work as you expect, and I'm open to ideas for making the display more clear.\n\nI have a number of challenges up. Enjoy!"},{"time":1736090444679,"text":"A \"balanced start\" variant has been added to Tablero di Berona in which the first player only rolls a single die on the very first turn of the game. The idea being that it better balances the second-player advantage. Let me know if there are any issues. (Thank you, @Samraku, for the suggestion.)"},{"time":1736281317481,"text":"The 3D game Terrace is now available. The default game is the 6x6, \"short\" game, but the 8x8 board and \"long\" versions are also available. I've also included the \"assassination\" rules for expanded capturing opportunities (described in the implementation notes and rules links). The default display is isometric, but you can select the flat version by clicking the cog icon below the game board. Let me know if you run into any issues. Enjoy! ( @Rollmo Down @eykca )"},{"time":1736454075559,"text":"The boardless dice game Cubeo is now available. It includes an unofficial movement variant that constrains movement more than usual. Let me know if you run into any issues. Enjoy!"},{"time":1736621122774,"text":"Thanks to the herculean efforts of @ypaul, Trax is now available! This is a boardless tile game where you try to form lines or loops with unique bicoloured tiles. Enjoy!"},{"time":1736702820459,"text":"Regarding Terrace, I had misunderstood the Assassination rules. They have been corrected."},{"time":1736725881013,"text":"Cameron Browne's game Yavalath is now available ( @ganelon ). Enjoy!"},{"time":1737072815034,"text":"The traditional French game Conspirateurs is now available ( @dx ). This includes the three- and four-player variants. The four-player variant is actually a partnership game with players 1 and 2 working against players 3 and 4. The default rules allow pieces to jump through sanctuary spaces, but the \"strict\" variant requires that pieces stop as soon as they enter a sanctuary. There's also a \"quick start\" option that starts the game with all pieces randomly dropped. Enjoy!"},{"time":1737227825453,"text":"Christian Freeling's game Storisende is now available. From what I've read, this is a game close to Christian's heart, and it is indeed deep and rewards study. The game takes longer than one might think, so first-time players are encouraged to start with the hexhex4 or hexhex5 boards. Larger and \"more interesting\" boards are available (including randomized modular boards), but be prepared for a long encounter. A reminder that the single-player playground is a place you can explore new games at your own pace. Let me know if you run into any issues. Enjoy!!"},{"time":1737322889027,"text":"@bael's and @emptytheory's games Basalt and Catapult are now available. Basalt is a connection game on a triangular board that involves a unique stacking mechanism. Catapult is an annihilation game where you toss stones across the board at each other. Enjoy!"},{"time":1737390033146,"text":"@Mark Khan's game Churn is now available. Fair warning, as the rules say, the length of the game increases exponentially with board size (thousands of plies at the larger two sizes), so start with the default board and go up from there with eyes open. Enjoy!"},{"time":1737759389302,"text":"@Avri's game Penguin Soccer is now live. In this game, two penguin families navigate the slippery ice and attempt to score a single goal. Enjoy!"},{"time":1737841396141,"text":"Andrew Perkis's asymmetrical game Owlman is now live. ( @abdekker ) A professor and his research assistants are trying to track down the mythical Owlman and his lair, while Owlman is trying to run them all out of the forest. Enjoy!"},{"time":1737848195425,"text":"Karl Scherer's game Squaredance is now available. This is another old SDG game ( @eykca ). Move lines of pieces by rotation to capture and isolate your opponent such that they cannot move. This one came together pretty quickly, so let me know if you run into any issues 🙂 Enjoy!"},{"time":1737930235695,"text":"@eykca's game Meg is now available. This is a very sharp, asymmetrical, push-your-luck style game where one player is trying to shoot the ball between two other players. You gotta pay attention! Enjoy!"},{"time":1738008857715,"text":"@logygames's game Yonmoque is now available. This is an n-in-a-row game where pieces move differently based on what cell they started from, and you can convert opposing pieces. Enjoy!"},{"time":1738016934874,"text":"I did not interpret the Owlman rules correctly. Captures now work as they should: when Owlman makes a step, the first helper along the line of movement is captured. My sincere apologies for the oversight."},{"time":1738019970557,"text":"In Yavalath three-player games, I missed a rule that required players block a next-opponent win. This has been corrected, but this required disabling the move list and automoves. Neglecting to block such a win will now result in the move being rejected with an explanation. Let me know if something does not work as you expect."},{"time":1738185405684,"text":"The Storisende game states were woefully inefficient, which has led to some issues in the database. I am pushing changes out now that should (hopefully invisibly) fix these issues. Your games should be automatically updated when you next make a move. If you encounter any issues, please let me know in #bug-reports. Thanks!"},{"time":1738353852983,"text":"@logygames's game Chameleon is now available. This is a chess-like game where the pieces have different movement options depending on the colour of the cell they started from. Eliminate the opposing forces or infiltrate your enemy's home row. Enjoy!"},{"time":1738441957756,"text":"Two more games are now live. Enjoy!\n- Masahiro Nakajima's game Amoeba is a stacking game where you attempt to entrap the opposing kernel. There are two modes of stack movement: direct movement and sowing. See the help text for instructions ( @Clark94 ).\n- @Gatsby's Gyve is a unification game where you place two stones per turn (each stone must touch the same number of friendly groups) in an effort to form fewer groups than your opponent."},{"time":1738451561597,"text":"The old SDG game Pah-Tum is now available ( @Samraku ). The default game involves the first player placing the five blocked cells and the second player choosing sides, but a \"quick start\" variant is also available. It's also possible to enable custodial captures. Highest score wins. Enjoy!"},{"time":1738526493449,"text":"Two more games are now live. Enjoy!\n- @logygames's Kachit Knights is a chess-like played on a tiny 4x4 board. Pieces can change how they will move in the future after moving.\n- The joint @Gatsby  + @Mark Khan game Nakatta is a square connection game where two piece configurations are forbidden."},{"time":1738713366362,"text":"@Gatsby's game Omny is now available ( @Drew Edwards (Coldsalmon) ). This is a generalized connection game where players try to split star cells into different regions so that no single region contains a majority of star cells. There are a lot of variants for this one. Board sizes range from 4 to 10, there are nine different star distribution scenarios (including random and freeform placement), and Adere-style captures can also be enabled. Enjoy!"},{"time":1739219237935,"text":"Just a reminder to folks that there is a #suggestions-voting channel. When I compile a list of games to code, that's the list I draw from. I encourage people to take a look periodically and vote on ones they feel strongly about. There are some features there too, but ideally this list is mostly games. You can add games to the list by typing `/suggest` and hitting Enter,  then following the bot in your DMs, but if you find the bot problematic, just let me know and I'll add it for you. Feature suggestions are best made in the #suggestions channel. Thanks!"},{"time":1739546065743,"text":"I've done some relatively major restructuring of the code to allow for flexibility when choosing the preselected defaults for variants. I've done a fair bit of testing, but I would be shocked if I caught *everything*. When using the playground, issuing challenges, requesting tournaments, or pairing manual events, please let me know if things do not work as you expect. Thank you!"},{"time":1739557069269,"text":"I've now also altered the game page status display so it shows the defaults as well. In the screen capture is a base Omny game with the two defaults (@Gatsby). It used to not display the variants display at all, but now it will show the implicit defaults. I'm sure this will bring to light various tweaks we can make to the game strings. Feel free to bring those to our attention, and we'll keep our eyes peeled as well. Cheers."},{"time":1740001673200,"text":"@MikePacru's games Pacru and Azacru are now available, both support 2-4 players. (Shacru will not be implemented.) Enjoy! ( @Nienna )"},{"time":1740592615201,"text":"SDG-style \"standing challenges\" are now available:\n- The front-facing nomenclature for challenges has been changed to simply \"open\" challenges (those that anybody can accept) and \"closed\" (ones you issue to specific opponents).\n- The term \"standing challenge\" is now being used to refer to a longstanding request that you configure for challenges of specific games.\n- At the bottom of your dashboard is a new table and button. A standing challenge works like most other challenges but also has a \"limit\" and a \"sensitivity.\"\n  - The limit is the maximum number of matching active games you want.\n  - The sensitivity refers to how \"matching\" is determined. If it's set to \"meta,\" then it counts *all* different active games you have for that specific game type. The setting \"variants\" also takes into account the specific variants you selected.\n- Twice a day, the system will look at all existing standing challenges. It will count up all the active games you are currently participating in that match the sensitivity of the challenge. If the number of active games is below your limit, and you have no matching open challenges already, then it will issue a single open challenge for that game + variant combination.\n- You can suspend and delete the standing challenges themselves, but suspending a challenge does not automatically revoke any challenges currently open.\n\nLet me know if something does not work as you expect or if you have any questions or further suggestions. Thanks!"},{"time":1740775566076,"text":"I unfortunately introduced a bug in the standing challenge code that has resulted in excess challenges being issued. The situation is now corrected. Feel free to manually revoke any excess open challenges. I apologize for the error."},{"time":1740780908596,"text":"Claude Leroy's game Gyges is now available ( @Mrraow ). In this game, players share the pieces and bounce them off of each other in an attempt to score on the opposing goal. Be alert! A poorly placed piece can end a game pretty quickly! Enjoy!"},{"time":1741119818629,"text":"@logygames's game CIFRA is now available. Enjoy!\n\nThe board configuration is random each game. Pieces have different move options depending on the colour of the tiles they cross. The game balances by the first player choosing what pieces they want to play and from what side, and then the second player makes the first move of the game. The game has three modes:\n- **Dash:** A simple breakthrough game where you try to get more of your pieces on the opposing home row than your opponent can to yours.\n- **Sum:** Same as Dash but the pieces have different values. You want the highest value of pieces on your opponent's home row.\n- **King:** Win by getting your king to the other side or capturing the opposing king."},{"time":1742137054191,"text":"Martin Ebel's game Ponte del Diavolo is now available. This includes 10x10 and 12x12 boards. Enjoy!"},{"time":1742582242046,"text":"@Corey L. Clark 's game Surmount is now available. This is an exnihilation game where smaller groups can quickly overwhelm larger ones. Enjoy!"},{"time":1743097482570,"text":"@Gatsby's game Morphos is now available. This is an OOSCG in which you can flip pieces in certain formations. There are a few different variants. Enjoy!"},{"time":1743263883454,"text":"@Corey L. Clark 's quite unique Realm-like game Gliss is now available. Enjoy! (While a great deal of effort went into making move generation as efficient as possible, it may at times take upwards of a second for the move highlights to appear. Please let me know if you encounter something more extreme.)"},{"time":1743365200664,"text":"Stephen Glenn's simultaneous game Assembly Line is now available. This is a lighter, simultaneous selection game where you try to trigger scoring when the highest value products are on your segments of the production line. Enjoy!"},{"time":1743365243518,"text":"A dodecahedral variant (12-sided dice) of @Mark Khan 's Cephalopod is now available."},{"time":1743883412092,"text":"@bael & @emptytheory 's group flipping game Paintbucket is now available. Enjoy!"},{"time":1743966236855,"text":"In the various places game metadata are listed (landing pages and the `i` dialogs beneath the boards), the people who coded the game are now listed. For both game designers and coders, if I know which AP player they are, their name will now link to that profile. (In the case where there is both an external URL and an AP userid present, then the name will link to the URL and the AP profile link will be to the `(AP)` suffix that will then appear.) Also, on player profiles, any games coded or designed will now be listed. There are lots of designers whose AP names I don't know. So if you've designed a game and it's not appearing on your player profile, please send me a DM and I'll link the names. Thanks to @Simplicatus Games for the suggestion."},{"time":1744395593841,"text":"Michael Seal's game [C1](https://play.abstractplay.com/games/c1) is now available, thanks to @ypaul. In this game, players move pieces *and board tiles* in an attempt to surround or cutoff the opposing cone. Enjoy!"},{"time":1745336997682,"text":"Timo Diegel's game [Bloqueo](https://play.abstractplay.com/games/bloqueo) is now live. Move shared pawns to place your pieces and create connected groups to outscore your opponent. Enjoy!"},{"time":1745337514979,"text":"We have now reached 200 games, and more are on the way! I know some feel this is too many, so I thought I might take this opportunity to clarify my goals:\n- I'm a librarian at heart, so first and foremost I want to create a place where a wide array of abstracts can be enjoyed. I have no upper limit in mind.\n- This a noncommercial, open source exercise. As long as hosting costs are covered, and someone is around to keep things going, the site will remain free to enjoy.\n- Because we are not chasing growth and financial gain, and we rely on volunteer effort, that means there will be ups and downs in developer activity. We encourage continued use of the #suggestions and #bug-reports channels, and as long as I'm around, those will be chipped away at. (If you know of developers who also like games, please send them our way!)\n\nWe're also approaching our second anniversary (May 1st). Thank you to the various @Developers  and @Code Contributors  who have generously donated time and talents, to the @Game Designers  for creating engaging rules, and to the many players who keep the community alive and whose bug reports, suggestions, and votes have helped us continue to improve. And of course thank you to Looney Labs and to a handful of individual donors who have helped ensure hosting is covered for at least the next few years. Just, thank you all ❤️"},{"time":1745602175520,"text":"Two new games are now available. Enjoy!\n- In @ManaT's game [Pilastri](https://play.abstractplay.com/games/pilastri), pieces are forced to climb higher and higher until someone runs out of moves. Don't let it be you!\n- In Michael Lefkowitz's game [Tessella](https://play.abstractplay.com/games/tessella), pieces work in pairs to capture their enemies. First to four captures wins."},{"time":1745879211367,"text":"@hoembla's loop-forming game [Stibro](https://play.abstractplay.com/games/stibro) is now available, thanks to, well, @hoembla 🙂 Enjoy!"},{"time":1746023947061,"text":"@logygames's game [GoRoGo](https://play.abstractplay.com/games/gorogo) is now available. This is a small-board Go variant with a unique piece type where the goal is to capture more pieces than to claim territory. Enjoy!"},{"time":1746023965275,"text":"Related to GoRoGo, a reminder that it is possible to customize the AP UI. There are details on the wiki (https://abstractplay.com/wiki/doku.php?id=customizing), and you can visit the #customization channel for support. (The pinned posts in that channel also have some helpful links.)"},{"time":1747763106294,"text":"The domino-style Decktet game [Biscuit](https://play.abstractplay.com/games/biscuit) is now available. 2 or 3 players take turns playing cards to a shared tableau to occasionally score points. Getting rid of all your cards first earns you a bunch of bonus points. The game is played over multiple rounds until someone reaches the goal score. At the end of that round, highest score wins. Enjoy!"},{"time":1747852209966,"text":"If you open your user settings panel (the cog icon next to your username, either at the top-right corner of your screen or in the \"hamburger\" menu on smaller screens), there is now an option to disable tournament start and end emails. This has been long requested, and I apologize for it taking so long to add. It's hard to validate small changes like this, so do let me know if you keep getting emails after disabling the setting. I'll note that tournament starts and ends are *only* announced by email. There is no other avenue currently to know that a tournament has ended other than actively monitoring the page. Also, tournament end emails should now include a link to the tournament in question. Let me know if you run into any issues."},{"time":1747859000335,"text":"Two changes:\n- There is now a [`/play`](https://play.abstractplay.com/play) route that will immediately take you to the next game in your queue (or to the dashboard if you have no available games). This also populates the \"next game\" queue.\n- I've tweaked the \"Next game\" button:\n  - The number in brackets is the number of games in the queue that are *not* the game you're currently viewing.\n  - If you're in the last game of your queue, the button will simply say \"Viewing last game.\"\n  - Once you've submitted your move in that last game, the button will then read \"Back to dashboard.\" But when you click it, it does actually refresh the queue first. So if an opponent made a move while you were making other moves, clicking the button will still take you to that game directly, despite what the button text says.\n\nLet me know if you encounter any issues."},{"time":1748038410043,"text":"The [`/games`](https://play.abstractplay.com/games) page has been tweaked. It now includes a drop-down menu letting you explore different ways of sorting the games, which will hopefully help newcomers find popular games more easily. Let me know if something does not work as expected, and I welcome further discussion of how to make the discovery process even better."},{"time":1748190199185,"text":"Challenges are now displayed in a tabular format, similar to the rest of the dashboard. The view/respond modals continue to work as they always have. This is more of a QoL improvement for people with many challenges. Also, to help people not miss the fact that they have been challenged to a game, an alert will now appear at the top of your dashboard if you have been directly challenged. Let me know if something does not work as you expect."},{"time":1748388347484,"text":"The rules to [Morphos](https://play.abstractplay.com/games/morphos) have changed:\n- In the standard game, there is a third formation and a new tiebreaker. Also, no more phantom edge stones.\n- In the \"double placement\" variant, the pie rule is now enabled (so the first player now places two stones) and the two stones must be orthogonally adjacent.\n- Aesthetically, the variant names have been updated and weak empty cells are also marked.\n\nFor the half-dozen games in progress, the original rules still apply. (But let me know if something unexpected happens in one of those games.) All games that start now (including any tournaments) will use the new rules. Let me know if there are any issues. Enjoy!"},{"time":1748645055925,"text":"I've made some \"under the hood\" code changes to the multi-layer games Akron, Margo, Spire, Spline, Sploof, Sponnect, Spook, Spree, and Upper Hand. All my tests show everything working, but if you do encounter any issues, please let me know. Thanks!"},{"time":1748794646270,"text":"The Decktet game [Quincunx](https://play.abstractplay.com/games/quincunx) is now available. This is another tableau-building game where the grid gets built out as you play. Each card played scores in a myriad of ways (including negative points). You play as many rounds as there are players (supports 2-3), and the highest cumulative score wins. A scoring summary is in the implementation notes (the `i` icon below the board). Enjoy!"},{"time":1749499966519,"text":"Thanks to @mcd, Cubeo has been updated to include variants for d8, d10, and d12. One note: the move generation for Cubeo is not well optimized, and that becomes apparent in these larger games (1 second or so to apply moves in the middle game). I will try to find time to resolve this, but I don't know exactly when. Enjoy, and thank you @mcd!"},{"time":1749571478634,"text":"The Decktet game [Siege of Jacynth](https://play.abstractplay.com/games/siegeofj) is now available. In this game, cards are armies attacking different segments of the wall around Jacynth. The goal is to be the force that breaks through the most wall segments. This one is less random than the other Decktet games. Lots of brain burning here, especially in the \"Full Deal\" variant. Enjoy!"},{"time":1749846271581,"text":"I've added a \"Join once\" button to the tournament page. Joining a tournament using this button means you will only be registered in the next tournament but not any later iterations. (You'll know you've \"joined once\" if you see an asterisk after your name in the participant list, as in the screen capture.) \"Join recurring\" does the normal behaviour of adding you to each following iteration until you withdraw. The withdraw button has also been relabelled \"Withdraw from next\" to make it clearer. You cannot withdraw from a tournament that has already started (other than resigning your games).\n\nThe purpose of the automated tournaments is to keep a steady flow of games you enjoy, but apparently there is also a desire to try a new game without having to remember to withdraw afterwards. Hopefully this helps, though it does make the interface a little more cluttered. Further feedback and suggestions are welcome. Thanks for playing!"},{"time":1751487818743,"text":"Two important frontend changes are now live:\n- Thanks to @mcd, the [Games page](https://play.abstractplay.com/games) and all its modules now have a grid view option. I do recognize that there are still issues with thumbnails in dark mode. Fundamental changes to the thumbnails are in the works. \n- Tournament results are now summarized in two places:\n  - On the [general stats page](https://play.abstractplay.com/stats), there is now a \"Tournament statistics\" page. This lists all the users that have ever participated in an automated tournament and a summary of their performance, including number of tournaments, number of wins, number of top-50% finishes, and total, average, and median \"score.\" Your score for each tournament is a number between 0 and 100 that represents your performance (first place gets 100 points, last place gets 0).\n  - On individual player profile pages, if that player has participated in any tournaments, they are listed along with the player's final result, number of participants, score received, and the date the tournament ended. There's also a link here to the tournament results table.\n\nPlease let us know if anything seems to be amiss. Further feedback and suggestions are welcome. Enjoy!"},{"time":1752087836530,"text":"The colour-blind palette has been adjusted. Further feedback is always welcome. I've also added a new alternate display for Entropy that adds a number to the different coloured pieces as well, to distinguish them even further. Let me know if you run into any issues."},{"time":1752161618155,"text":"Thanks to @mcd , Kanare Kato's game [Stairs](https://play.abstractplay.com/games/stairs) is now live. Race to create the tallest stack. Enjoy!"},{"time":1752424140944,"text":"The default and the built-in colour-blind palettes have been expanded to 12 colours. For most games, the change will be imperceptible. It will be more noticeable in games like Entropy and Tintas (the first image is the original palette, the second is the new). But this change now allows us to include games with larger palette requirements. Custom palettes remain \"a thing\" (see the #customization channel for details). Let us know if you have any issues."},{"time":1752606032095,"text":"Thanks to @mcd, two changes have been made on the front end:\n- There is now a \"use preferred player colour\" option. When set and a palette is applied, then you will always appear as that given colour, regardless of the player order. For this to work, you must create a custom palette with your preferred colour first (as \"Player 1\") and apply that palette to any games where you want this feature to work (see the #customization channel for details). A reminder that this type of customization is only visible to you. It does not affect other players' experiences.\n- Also, the palette creation screen has been improved and now includes the default 12 colours as swatches.\n\nLet us know if you run into any issues. Enjoy!"},{"time":1756918924589,"text":"@cdunc123 's game [Bluestone](https://play.abstractplay.com/games/bluestone) is now available (thanks to @ManaT ). This is a hybrid area-control/connection game where you try to connect your groups to more of the perimeter stones than your opponent. Enjoy!"},{"time":1759338619858,"text":"The latest Chrome update (`Version 141.0.7390.55 (Official Build) (64-bit)`) has changed something about how they render SVGs, resulting in some very weird results on some game boards. All I can say at this point is that we're aware of the issue and will do what we can to figure out the root cause and adjust. I can't say how long that may take. If people have actionable information on the issue, feel free to share it: https://discord.com/channels/526483743180062720/1422984901086679081. Thank you for your patience."},{"time":1759341983423,"text":"The Chrome issue *appears* to be fixed, but please let us know if something else doesn't look right. Thanks to @ManaT and @mcd for helping me triangulate the issue."},{"time":1761402451195,"text":"Two hex-board variants for [Lines of Action](https://play.abstractplay.com/games/loa) are now available. Hex5 is the game Alveole: 9 pieces each, clustered in each corner. Hex6 is more traditional, 12 pieces each, with a black hole in the centre (\"scrambled eggs\" setup also works). Enjoy!"},{"time":1763150828641,"text":"@Donegal's Decktet game [Deckfish](https://play.abstractplay.com/games/deckfish) is now available, thanks to @mcd. In this game players move tokens around a tableau of cards to collect suits. The highest scoring collection wins. Enjoy!"},{"time":1763158325646,"text":"@hoembla's game [Sunspot](https://play.abstractplay.com/games/sunspot) is now available, thanks to @hoembla! Place and flip stones in an attempt to form a loop. Enjoy!"},{"time":1763851801525,"text":"The Decktet game [Emu Ranchers](https://play.abstractplay.com/games/emu) is now available. In this game reminiscent of Lost Cities, players hatch birds, grow them, and hopefully harvest them for a profit at the end of the year. Highest score over multiple years wins. Enjoy!"},{"time":1765560228953,"text":"Russ Williams's pyramid game [Stawvs](https://play.abstractplay.com/games/stawvs) is now available, thanks to @mcd. This is a sort of hybrid of Amazons and Volcano. Enjoy!"},{"time":1765586777998,"text":"The way the site generates thumbnails has finally been updated.\n- Once a day, the site chooses a random active instance of a game (or a random completed game if no games are currently being played).\n- The current state is rendered in light and dark modes.\n- The thumbnails you see in the browser will adjust based on the colour mode you've chosen.\n\nThis means that thumbnails will more accurately reflect actual game play and will change from day to day. It also *greatly* reduces the size of the payload your browser downloads when you visit the site.\n\nThe rendering doesn't know about user settings, so they are still rendered using the default colours, and if you've edited your \"colour context\" (very few have), then the thumbnails may look a little odd because they're rendered using the default contexts. If you encounter any broken or otherwise weird thumbnails, please let me know. Enjoy!"},{"time":1765820757315,"text":"Emanuel Lasker's Draughts variant [Lasca](https://play.abstractplay.com/games/lasca), and @christianF's variation on the theme, [Emergo](https://play.abstractplay.com/games/emergo), are both now available. Both employ a capturing mechanic where captured pieces remain on the board and can be freed later. Enjoy!"},{"time":1765911150787,"text":"I've moved the \"wishlist\" to BGG, abandoning entirely the `/suggest` bot. I've created a redirect at https://wishlist.abstractplay.com (but until DNS fully propagates, here's a direct link too: https://boardgamegeek.com/geeklist/369284/abstract-play-wishlist). Please visit, add games you recommend, and thumb the games you're most excited about. Comments are open too. I moved most of the existing suggestions already, and I've archived the old channel. Thanks for your continued involvement!"},{"time":1766758725471,"text":"I have now added basic websocket support to the site. This doesn't change anything about how the backend currently functions, but this lays the foundation for more real-time features in the future. Two new features are available now, though:\n- Next to the button for toggling colour modes, there's now a wifi icon and a number. That number is the number of players currently using the site at that moment (including yourself).\n- More importantly, though, games will now auto-reload when a move is made or a chat is added, whether you're participating or observing. Basically, if you're looking at the page, it will refresh when someone changes the state. This will hopefully make playing realtime games more bearable. I've removed the \"periodic refresh\" button as a result.\n\nLet me know if you encounter any issues. Enjoy!"},{"time":1766885334062,"text":"Next to the connection count will shortly appear an \"eye\" icon. You can click it to mark yourself as \"invisible.\" You will still be reflected in the count, but your userid will not be flagged as \"online.\" This setting is persisted *per device*. So you'll have to set it on your desktop and your phone if you want it to consistently persist. Eventually I will be adding some filters/indicators in a few places of when people are online. I will be tweaking the UI for sure, so suggestions on how to better display this information are welcome."},{"time":1766943606775,"text":"On the Players page, you can now hide offline players, and on game play pages, there's a wifi icon next to players who are currently online. Invisibility mode disables this. Further suggestions welcome."},{"time":1768057071381,"text":"@Marino Carpignano PerGioco 's four-in-a-row game Krypte is now available, thanks to @hoembla. Enjoy!"},{"time":1768247186494,"text":"Two new games are now available. Enjoy!\n- Dieter Stein's newest game [Enso](https://play.abstractplay.com/games/enso) is a move and capture game where the goal is surround one of your pieces with eight empty spaces.\n- @Corey L. Clark's annihilation game [Rampart](https://play.abstractplay.com/games/rampart) starts with a predetermined set of groups; grow your own and starve your opponent's. Includes 11x11, 13x13, and hexhex7 boards, and includes a \"free placement\" option if two well-communicating opponents want to experiment with different setups."}]
